[Killed] BlockStatement
src/infrastructure/cache/CacheInvalidationService.ts:41:51
     /**
      * Applies namespace prefix to cache keys for isolation and clarity.
      */
-    private getNamespacedKey(key: string): string {
-        return this.CACHE_PREFIX + key
-    }
+    private getNamespacedKey(key: string): string {}
 
     /**
killedBy: CacheInvalidationService namespacing invalidatePublicBlogs deletes portfolio:v1:blog:list:public
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:blog:list:public"
Received: undefined

Number of calls: 1

[Killed] ArithmeticOperator
src/infrastructure/cache/CacheInvalidationService.ts:42:16
      * Applies namespace prefix to cache keys for isolation and clarity.
      */
     private getNamespacedKey(key: string): string {
-        return this.CACHE_PREFIX + key
+        return this.CACHE_PREFIX - key
     }
 
killedBy: CacheInvalidationService namespacing invalidatePublicBlogs deletes portfolio:v1:blog:list:public
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:blog:list:public"
Received: NaN

Number of calls: 1

[Killed] BlockStatement
src/infrastructure/cache/CacheInvalidationService.ts:48:54
     /**
      * Safely deletes a single key with error handling.
      */
-    private async delete(key: string): Promise<void> {
-        try {
-        const namespacedKey = this.getNamespacedKey(key)
-        await this.cacheManager.del(namespacedKey)
-        } catch (error) {
-        this.logger.error(`Failed to delete cache key: ${key}`, error)
-        }
-    }
+    private async delete(key: string): Promise<void> {}
 
     /**
killedBy: CacheInvalidationService namespacing invalidatePublicBlogs deletes portfolio:v1:blog:list:public
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:blog:list:public"

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/cache/CacheInvalidationService.ts:49:13
      * Safely deletes a single key with error handling.
      */
     private async delete(key: string): Promise<void> {
-        try {
-        const namespacedKey = this.getNamespacedKey(key)
-        await this.cacheManager.del(namespacedKey)
-        } catch (error) {
+        try {} catch (error) {
         this.logger.error(`Failed to delete cache key: ${key}`, error)
         }
killedBy: CacheInvalidationService namespacing invalidatePublicBlogs deletes portfolio:v1:blog:list:public
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:blog:list:public"

Number of calls: 0

[Survived] BlockStatement
src/infrastructure/cache/CacheInvalidationService.ts:52:25
         try {
         const namespacedKey = this.getNamespacedKey(key)
         await this.cacheManager.del(namespacedKey)
-        } catch (error) {
-        this.logger.error(`Failed to delete cache key: ${key}`, error)
-        }
+        } catch (error) {}
     }
 

[Killed] BlockStatement
src/infrastructure/cache/CacheInvalidationService.ts:61:65
      * Deletes multiple keys matching a pattern.
      * Uses Redis-specific API when available, falls back gracefully.
      */
-    private async deletePattern(pattern: string): Promise<void> {
-        const namespacedPattern = this.getNamespacedKey(pattern)
-        try {
-            const store = (this.cacheManager as any).store
-            if (store?.keys) {
-                const keys = await store.keys(namespacedPattern)
-                if (keys?.length > 0) {
-                    await Promise.all(keys.map((key: string) => this.cacheManager.del(key)))
-                    this.logger.log(`Invalidated ${keys.length} keys with pattern: ${pattern}`)
-                }
-            }
-        } catch (error) {
-            this.logger.warn(`Pattern invalidation partially failed for: ${pattern}`, error)
-        }
-    }
+    private async deletePattern(pattern: string): Promise<void> {}
 
     // ===================================================================
killedBy: CacheInvalidationService deletePattern — namespacing scans with portfolio:v1:blog:* — not portfolio:v1:portfolio:v1:blog:*
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:blog:*"

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/cache/CacheInvalidationService.ts:63:13
      */
     private async deletePattern(pattern: string): Promise<void> {
         const namespacedPattern = this.getNamespacedKey(pattern)
-        try {
-            const store = (this.cacheManager as any).store
-            if (store?.keys) {
-                const keys = await store.keys(namespacedPattern)
-                if (keys?.length > 0) {
-                    await Promise.all(keys.map((key: string) => this.cacheManager.del(key)))
-                    this.logger.log(`Invalidated ${keys.length} keys with pattern: ${pattern}`)
-                }
-            }
-        } catch (error) {
+        try {} catch (error) {
             this.logger.warn(`Pattern invalidation partially failed for: ${pattern}`, error)
         }
killedBy: CacheInvalidationService deletePattern — namespacing scans with portfolio:v1:blog:* — not portfolio:v1:portfolio:v1:blog:*
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:blog:*"

Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/cache/CacheInvalidationService.ts:65:17
         const namespacedPattern = this.getNamespacedKey(pattern)
         try {
             const store = (this.cacheManager as any).store
-            if (store?.keys) {
+            if (false) {
                 const keys = await store.keys(namespacedPattern)
                 if (keys?.length > 0) {
killedBy: CacheInvalidationService deletePattern — namespacing scans with portfolio:v1:blog:* — not portfolio:v1:portfolio:v1:blog:*
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:blog:*"

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/cache/CacheInvalidationService.ts:65:30
         const namespacedPattern = this.getNamespacedKey(pattern)
         try {
             const store = (this.cacheManager as any).store
-            if (store?.keys) {
-                const keys = await store.keys(namespacedPattern)
-                if (keys?.length > 0) {
-                    await Promise.all(keys.map((key: string) => this.cacheManager.del(key)))
-                    this.logger.log(`Invalidated ${keys.length} keys with pattern: ${pattern}`)
-                }
-            }
+            if (store?.keys) {}
         } catch (error) {
             this.logger.warn(`Pattern invalidation partially failed for: ${pattern}`, error)
killedBy: CacheInvalidationService deletePattern — namespacing scans with portfolio:v1:blog:* — not portfolio:v1:portfolio:v1:blog:*
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:blog:*"

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/cache/CacheInvalidationService.ts:67:39
             const store = (this.cacheManager as any).store
             if (store?.keys) {
                 const keys = await store.keys(namespacedPattern)
-                if (keys?.length > 0) {
-                    await Promise.all(keys.map((key: string) => this.cacheManager.del(key)))
-                    this.logger.log(`Invalidated ${keys.length} keys with pattern: ${pattern}`)
-                }
+                if (keys?.length > 0) {}
             }
         } catch (error) {
killedBy: CacheInvalidationService deletePattern — bulk deletion deletes all keys returned by store.keys()
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/cache/CacheInvalidationService.ts:67:21
             const store = (this.cacheManager as any).store
             if (store?.keys) {
                 const keys = await store.keys(namespacedPattern)
-                if (keys?.length > 0) {
+                if (false) {
                     await Promise.all(keys.map((key: string) => this.cacheManager.del(key)))
                     this.logger.log(`Invalidated ${keys.length} keys with pattern: ${pattern}`)
killedBy: CacheInvalidationService deletePattern — bulk deletion deletes all keys returned by store.keys()
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 0

[Killed] ArrowFunction
src/infrastructure/cache/CacheInvalidationService.ts:68:48
             if (store?.keys) {
                 const keys = await store.keys(namespacedPattern)
                 if (keys?.length > 0) {
-                    await Promise.all(keys.map((key: string) => this.cacheManager.del(key)))
+                    await Promise.all(keys.map(() => undefined))
                     this.logger.log(`Invalidated ${keys.length} keys with pattern: ${pattern}`)
                 }
killedBy: CacheInvalidationService deletePattern — bulk deletion deletes all keys returned by store.keys()
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 0

[NoCoverage] BlockStatement
src/infrastructure/cache/CacheInvalidationService.ts:72:25
                     this.logger.log(`Invalidated ${keys.length} keys with pattern: ${pattern}`)
                 }
             }
-        } catch (error) {
-            this.logger.warn(`Pattern invalidation partially failed for: ${pattern}`, error)
-        }
+        } catch (error) {}
     }
 

[Killed] BlockStatement
src/infrastructure/cache/CacheInvalidationService.ts:82:50
     // ===================================================================
 
     // --------------------- Blog ---------------------
-    async invalidatePublicBlogs(): Promise<void> {
-        await this.delete('blog:list:public')
-    }
+    async invalidatePublicBlogs(): Promise<void> {}
 
     async invalidateBlogBySlug(slug: string): Promise<void> {
killedBy: CacheInvalidationService namespacing invalidatePublicBlogs deletes portfolio:v1:blog:list:public
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:blog:list:public"

Number of calls: 0

[Killed] StringLiteral
src/infrastructure/cache/CacheInvalidationService.ts:83:27
 
     // --------------------- Blog ---------------------
     async invalidatePublicBlogs(): Promise<void> {
-        await this.delete('blog:list:public')
+        await this.delete("")
     }
 
killedBy: CacheInvalidationService namespacing invalidatePublicBlogs deletes portfolio:v1:blog:list:public
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:blog:list:public"
Received: "portfolio:v1:"

Number of calls: 1

[Killed] BlockStatement
src/infrastructure/cache/CacheInvalidationService.ts:86:61
         await this.delete('blog:list:public')
     }
 
-    async invalidateBlogBySlug(slug: string): Promise<void> {
-        await this.delete(`blog:${slug}`)
-    }
+    async invalidateBlogBySlug(slug: string): Promise<void> {}
 
     async invalidateAllBlogs(): Promise<void> {
killedBy: CacheInvalidationService namespacing invalidateBlogBySlug deletes portfolio:v1:blog:{slug}
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:blog:my-blog-post"

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/cache/CacheInvalidationService.ts:90:47
         await this.delete(`blog:${slug}`)
     }
 
-    async invalidateAllBlogs(): Promise<void> {
-        await this.deletePattern('blog:*')
-    }
+    async invalidateAllBlogs(): Promise<void> {}
 
     // --------------------- Project ---------------------
killedBy: CacheInvalidationService deletePattern — namespacing scans with portfolio:v1:blog:* — not portfolio:v1:portfolio:v1:blog:*
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:blog:*"

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/cache/CacheInvalidationService.ts:95:53
     }
 
     // --------------------- Project ---------------------
-    async invalidatePublicProjects(): Promise<void> {
-        await this.delete('project:list:public')
-    }
+    async invalidatePublicProjects(): Promise<void> {}
 
     async invalidateProjectBySlug(slug: string): Promise<void> {
killedBy: CacheInvalidationService namespacing invalidatePublicProjects deletes portfolio:v1:project:list:public
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:project:list:public"

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/cache/CacheInvalidationService.ts:99:64
         await this.delete('project:list:public')
     }
 
-    async invalidateProjectBySlug(slug: string): Promise<void> {
-        await this.delete(`project:${slug}`)
-    }
+    async invalidateProjectBySlug(slug: string): Promise<void> {}
 
     async invalidateAllProjects(): Promise<void> {
killedBy: CacheInvalidationService namespacing invalidateProjectBySlug deletes portfolio:v1:project:{slug}
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:project:my-project"

Number of calls: 0

[Killed] StringLiteral
src/infrastructure/cache/CacheInvalidationService.ts:100:27
     }
 
     async invalidateProjectBySlug(slug: string): Promise<void> {
-        await this.delete(`project:${slug}`)
+        await this.delete(``)
     }
 
killedBy: CacheInvalidationService namespacing invalidateProjectBySlug deletes portfolio:v1:project:{slug}
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:project:my-project"
Received: "portfolio:v1:"

Number of calls: 1

[Killed] BlockStatement
src/infrastructure/cache/CacheInvalidationService.ts:103:50
         await this.delete(`project:${slug}`)
     }
 
-    async invalidateAllProjects(): Promise<void> {
-        await this.deletePattern('project:*')
-    }
+    async invalidateAllProjects(): Promise<void> {}
 
     // --------------------- Skill ---------------------
killedBy: CacheInvalidationService deletePattern — namespacing scans with portfolio:v1:project:* for invalidateAllProjects
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:project:*"

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/cache/CacheInvalidationService.ts:108:51
     }
 
     // --------------------- Skill ---------------------
-    async invalidatePublicSkills(): Promise<void> {
-        await this.delete('skill:list:public')
-    }
+    async invalidatePublicSkills(): Promise<void> {}
 
     // --------------------- Certification ---------------------
killedBy: CacheInvalidationService namespacing invalidatePublicSkills deletes portfolio:v1:skill:list:public
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:skill:list:public"

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/cache/CacheInvalidationService.ts:113:59
     }
 
     // --------------------- Certification ---------------------
-    async invalidatePublicCertifications(): Promise<void> {
-        await this.delete('certification:list:public')
-    }
+    async invalidatePublicCertifications(): Promise<void> {}
 
     // --------------------- Education ---------------------
killedBy: CacheInvalidationService namespacing invalidatePublicCertifications deletes portfolio:v1:certification:list:public
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:certification:list:public"

Number of calls: 0

[Killed] StringLiteral
src/infrastructure/cache/CacheInvalidationService.ts:114:27
 
     // --------------------- Certification ---------------------
     async invalidatePublicCertifications(): Promise<void> {
-        await this.delete('certification:list:public')
+        await this.delete("")
     }
 
killedBy: CacheInvalidationService namespacing invalidatePublicCertifications deletes portfolio:v1:certification:list:public
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:certification:list:public"
Received: "portfolio:v1:"

Number of calls: 1

[Killed] BlockStatement
src/infrastructure/cache/CacheInvalidationService.ts:118:54
     }
 
     // --------------------- Education ---------------------
-    async invalidatePublicEducation(): Promise<void> {
-        await this.delete('education:list:public')
-    }
+    async invalidatePublicEducation(): Promise<void> {}
 
     // --------------------- Job ---------------------
killedBy: CacheInvalidationService namespacing invalidatePublicEducation deletes portfolio:v1:education:list:public
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:education:list:public"

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/cache/CacheInvalidationService.ts:123:49
     }
 
     // --------------------- Job ---------------------
-    async invalidatePublicJobs(): Promise<void> {
-        await this.delete('job:list:public')
-    }
+    async invalidatePublicJobs(): Promise<void> {}
 
     // --------------------- Social ---------------------
killedBy: CacheInvalidationService namespacing invalidatePublicJobs deletes portfolio:v1:job:list:public
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:job:list:public"

Number of calls: 0

[Killed] StringLiteral
src/infrastructure/cache/CacheInvalidationService.ts:124:27
 
     // --------------------- Job ---------------------
     async invalidatePublicJobs(): Promise<void> {
-        await this.delete('job:list:public')
+        await this.delete("")
     }
 
killedBy: CacheInvalidationService namespacing invalidatePublicJobs deletes portfolio:v1:job:list:public
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:job:list:public"
Received: "portfolio:v1:"

Number of calls: 1

[Killed] BlockStatement
src/infrastructure/cache/CacheInvalidationService.ts:128:59
     }
 
     // --------------------- Social ---------------------
-    async invalidatePublicSocialAccounts(): Promise<void> {
-        await this.delete('social:list:public')
-    }
+    async invalidatePublicSocialAccounts(): Promise<void> {}
 
     // --------------------- Advanced ---------------------
killedBy: CacheInvalidationService namespacing invalidatePublicSocialAccounts deletes portfolio:v1:social:list:public
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:social:list:public"

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/cache/CacheInvalidationService.ts:137:61
      * Invalidates cache entries by pattern.
      * Useful for bulk invalidation (e.g., after bulk updates).
      */
-    async invalidatePattern(pattern: string): Promise<void> {
-        await this.deletePattern(pattern)
-    }
+    async invalidatePattern(pattern: string): Promise<void> {}
 }
killedBy: CacheInvalidationService invalidatePattern() delegates to deletePattern with correct namespaced key
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:custom:*"

Number of calls: 0
