[Killed] StringLiteral
src/application/services/AuthService.ts:33:55
 @Injectable()
 export class AuthService implements OnModuleInit {
     private static readonly ACCESS_TOKEN_EXPIRY     = '15m'
-    private static readonly REFRESH_TOKEN_EXPIRY    = '7d'
+    private static readonly REFRESH_TOKEN_EXPIRY    = ""
     private static readonly REFRESH_TOKEN_EXPIRY_MS = 7 * 24 * 60 * 60 * 1000
 
killedBy: AuthService login() signs refresh token with correct claims
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"type": "refresh"}, ObjectContaining {"expiresIn": "7d"}
Received
       1: {"fingerprint": "fp", "jti": "3c8da918-b4d1-487b-9745-1c664c09f129", "role": "admin", "sub": 1}, {"expiresIn": "15m"}
       2: {"jti": "0bed6631-31f6-4e2b-ab09-2d69ea3206cd", "sub": 1, "type": "refresh"}, {"expiresIn": ""}

Number of c

[Killed] ArithmeticOperator
src/application/services/AuthService.ts:34:55
 export class AuthService implements OnModuleInit {
     private static readonly ACCESS_TOKEN_EXPIRY     = '15m'
     private static readonly REFRESH_TOKEN_EXPIRY    = '7d'
-    private static readonly REFRESH_TOKEN_EXPIRY_MS = 7 * 24 * 60 * 60 * 1000
+    private static readonly REFRESH_TOKEN_EXPIRY_MS = 7 * 24 / 60 * 60 * 1000
 
     constructor(
killedBy: AuthService getRefreshTokenExpiryMs() returns 7 days in milliseconds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 604800000
Received: 168000

[Killed] ArithmeticOperator
src/application/services/AuthService.ts:34:55
 export class AuthService implements OnModuleInit {
     private static readonly ACCESS_TOKEN_EXPIRY     = '15m'
     private static readonly REFRESH_TOKEN_EXPIRY    = '7d'
-    private static readonly REFRESH_TOKEN_EXPIRY_MS = 7 * 24 * 60 * 60 * 1000
+    private static readonly REFRESH_TOKEN_EXPIRY_MS = 7 * 24 * 60 / 60 * 1000
 
     constructor(
killedBy: AuthService getRefreshTokenExpiryMs() returns 7 days in milliseconds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 604800000
Received: 168000

[Killed] BlockStatement
src/application/services/AuthService.ts:50:41
     // Lifecycle
     // ===========================================================================
 
-    async onModuleInit(): Promise<void> {
-        // Warm up V8 JIT compiler for JWT signing path.
-        // First real login will hit the compiled code instead of interpreted code,
-        // reducing cold-start latency from ~12ms to ~3ms.
-        await this.jwt.signAsync({ warmup: true }, { expiresIn: '1s' })
-    }
+    async onModuleInit(): Promise<void> {}
 
     // ===========================================================================
killedBy: AuthService onModuleInit() calls jwt.signAsync to warm up JIT on init
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"warmup": true}, ObjectContaining {"expiresIn": "1s"}

Number of calls: 0

[Killed] BooleanLiteral
src/application/services/AuthService.ts:54:44
         // Warm up V8 JIT compiler for JWT signing path.
         // First real login will hit the compiled code instead of interpreted code,
         // reducing cold-start latency from ~12ms to ~3ms.
-        await this.jwt.signAsync({ warmup: true }, { expiresIn: '1s' })
+        await this.jwt.signAsync({ warmup: false }, { expiresIn: '1s' })
     }
 
killedBy: AuthService onModuleInit() calls jwt.signAsync to warm up JIT on init
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"warmup": true}, ObjectContaining {"expiresIn": "1s"}
Received: {"warmup": false}, {"expiresIn": "1s"}

Number of calls: 1

[Killed] ObjectLiteral
src/application/services/AuthService.ts:54:52
         // Warm up V8 JIT compiler for JWT signing path.
         // First real login will hit the compiled code instead of interpreted code,
         // reducing cold-start latency from ~12ms to ~3ms.
-        await this.jwt.signAsync({ warmup: true }, { expiresIn: '1s' })
+        await this.jwt.signAsync({ warmup: true }, {})
     }
 
killedBy: AuthService onModuleInit() calls jwt.signAsync to warm up JIT on init
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"warmup": true}, ObjectContaining {"expiresIn": "1s"}
Received: {"warmup": true}, {}

Number of calls: 1

[Killed] BlockStatement
src/application/services/AuthService.ts:64:63
         password:    string,
         fingerprint: string,
         userId:      number,
-    ): Promise<{ accessToken: string; refreshToken: string }> {
-        const adminPassword = process.env.ADMIN_PASSWORD
-        if (!adminPassword) {
-            throw new Error('[AuthService] ADMIN_PASSWORD environment variable is not set')
-        }
-
-        // timingSafeEqual requires equal-length buffers — length mismatch means
-        // wrong password, short-circuit before calling it to avoid RangeError.
-        const isValid = password.length === adminPassword.length &&
-            crypto.timingSafeEqual(
-                Buffer.from(password),
-                Buffer.from(adminPassword),
-            )
-
-        if (!isValid) throw new UnauthorizedError('Invalid credentials')
-
-        const [accessToken, refreshToken] = await Promise.all([
-            this.issueAccessToken(userId, fingerprint),
-            this.issueRefreshToken(userId),
-        ])
-
-        return { accessToken, refreshToken }
-    }
+    ): Promise<{ accessToken: string; refreshToken: string }> {}
 
     // ===========================================================================
killedBy: AuthService login() returns access and refresh tokens on valid credentials
statusReason: Error: expect(received).toHaveProperty(path)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ConditionalExpression
src/application/services/AuthService.ts:66:13
         userId:      number,
     ): Promise<{ accessToken: string; refreshToken: string }> {
         const adminPassword = process.env.ADMIN_PASSWORD
-        if (!adminPassword) {
+        if (false) {
             throw new Error('[AuthService] ADMIN_PASSWORD environment variable is not set')
         }
killedBy: AuthService login() throws if ADMIN_PASSWORD env var is not set
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "[AuthService] ADMIN_PASSWORD environment variable is not set"
Received message:   "Cannot read properties of undefined (reading 'length')"

      123 |       // timingSafeEqual requires equal-length buffers — length mismatch means
      124 |       // wrong password, short-circuit before calling it to avoid RangeError.

[Killed] ConditionalExpression
src/application/services/AuthService.ts:66:13
         userId:      number,
     ): Promise<{ accessToken: string; refreshToken: string }> {
         const adminPassword = process.env.ADMIN_PASSWORD
-        if (!adminPassword) {
+        if (true) {
             throw new Error('[AuthService] ADMIN_PASSWORD environment variable is not set')
         }
killedBy: AuthService login() returns access and refresh tokens on valid credentials
statusReason: Error: [AuthService] ADMIN_PASSWORD environment variable is not set

[Killed] ConditionalExpression
src/application/services/AuthService.ts:72:25
 
         // timingSafeEqual requires equal-length buffers — length mismatch means
         // wrong password, short-circuit before calling it to avoid RangeError.
-        const isValid = password.length === adminPassword.length &&
-            crypto.timingSafeEqual(
-                Buffer.from(password),
-                Buffer.from(adminPassword),
-            )
+        const isValid = false
 
         if (!isValid) throw new UnauthorizedError('Invalid credentials')
killedBy: AuthService login() returns access and refresh tokens on valid credentials
statusReason: UnauthorizedError: Invalid credentials

[Killed] LogicalOperator
src/application/services/AuthService.ts:72:25
 
         // timingSafeEqual requires equal-length buffers — length mismatch means
         // wrong password, short-circuit before calling it to avoid RangeError.
-        const isValid = password.length === adminPassword.length &&
-            crypto.timingSafeEqual(
-                Buffer.from(password),
-                Buffer.from(adminPassword),
-            )
+        const isValid = password.length === adminPassword.length || crypto.timingSafeEqual(Buffer.from(password), Buffer.from(adminPassword))
 
         if (!isValid) throw new UnauthorizedError('Invalid credentials')
killedBy: AuthService login() throws UnauthorizedError on wrong password
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: UnauthorizedError
Received constructor: RangeError

Received message: "Input buffers must have the same byte length"

      123 |       // timingSafeEqual requires equal-length buffers — length mismatch means

[Killed] ConditionalExpression
src/application/services/AuthService.ts:78:13
                 Buffer.from(adminPassword),
             )
 
-        if (!isValid) throw new UnauthorizedError('Invalid credentials')
+        if (false) throw new UnauthorizedError('Invalid credentials')
 
         const [accessToken, refreshToken] = await Promise.all([
killedBy: AuthService login() throws UnauthorizedError on wrong password
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"accessToken": "signed-token", "refreshToken": "signed-token"}

[Killed] ConditionalExpression
src/application/services/AuthService.ts:78:13
                 Buffer.from(adminPassword),
             )
 
-        if (!isValid) throw new UnauthorizedError('Invalid credentials')
+        if (true) throw new UnauthorizedError('Invalid credentials')
 
         const [accessToken, refreshToken] = await Promise.all([
killedBy: AuthService login() returns access and refresh tokens on valid credentials
statusReason: UnauthorizedError: Invalid credentials

[Killed] ObjectLiteral
src/application/services/AuthService.ts:85:16
             this.issueRefreshToken(userId),
         ])
 
-        return { accessToken, refreshToken }
+        return {}
     }
 
killedBy: AuthService login() returns access and refresh tokens on valid credentials
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "accessToken"
Received path: []

Received value: {}

[Killed] BlockStatement
src/application/services/AuthService.ts:91:96
     // ===========================================================================
     // Refresh Token
     // ===========================================================================
-    async refresh(refreshToken: string, fingerprint: string): Promise<{ accessToken: string }> {
-        let payload: RefreshTokenPayload
-
-        try {
-            payload = await this.jwt.verifyAsync<RefreshTokenPayload>(refreshToken)
-        } catch {
-            throw new UnauthorizedError('Invalid refresh token')
-        }
-
-        if (payload.type !== 'refresh') throw new UnauthorizedError('Invalid token type')
-
-        const revoked = await this.isTokenRevoked(payload.jti)
-        if (revoked) throw new UnauthorizedError('Token has been revoked')
-
-        return { accessToken: await this.issueAccessToken(payload.sub, fingerprint) }
-    }
+    async refresh(refreshToken: string, fingerprint: string): Promise<{ accessToken: string }> {}
 
     // ===========================================================================
killedBy: AuthService refresh() issues a new access token for a valid refresh token
statusReason: Error: expect(received).toHaveProperty(path, value)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BlockStatement
src/application/services/AuthService.ts:94:13
     async refresh(refreshToken: string, fingerprint: string): Promise<{ accessToken: string }> {
         let payload: RefreshTokenPayload
 
-        try {
-            payload = await this.jwt.verifyAsync<RefreshTokenPayload>(refreshToken)
-        } catch {
+        try {} catch {
             throw new UnauthorizedError('Invalid refresh token')
         }
killedBy: AuthService refresh() issues a new access token for a valid refresh token
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] BlockStatement
src/application/services/AuthService.ts:96:17
 
         try {
             payload = await this.jwt.verifyAsync<RefreshTokenPayload>(refreshToken)
-        } catch {
-            throw new UnauthorizedError('Invalid refresh token')
-        }
+        } catch {}
 
         if (payload.type !== 'refresh') throw new UnauthorizedError('Invalid token type')
killedBy: AuthService refresh() throws UnauthorizedError if JWT verification fails
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: UnauthorizedError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'type')"

      159 |         }

[Survived] StringLiteral
src/application/services/AuthService.ts:97:41
         try {
             payload = await this.jwt.verifyAsync<RefreshTokenPayload>(refreshToken)
         } catch {
-            throw new UnauthorizedError('Invalid refresh token')
+            throw new UnauthorizedError("")
         }
 

[Killed] ConditionalExpression
src/application/services/AuthService.ts:100:13
             throw new UnauthorizedError('Invalid refresh token')
         }
 
-        if (payload.type !== 'refresh') throw new UnauthorizedError('Invalid token type')
+        if (false) throw new UnauthorizedError('Invalid token type')
 
         const revoked = await this.isTokenRevoked(payload.jti)
killedBy: AuthService refresh() throws UnauthorizedError if token type is not refresh
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"accessToken": "signed-token"}

[Killed] ConditionalExpression
src/application/services/AuthService.ts:100:13
             throw new UnauthorizedError('Invalid refresh token')
         }
 
-        if (payload.type !== 'refresh') throw new UnauthorizedError('Invalid token type')
+        if (true) throw new UnauthorizedError('Invalid token type')
 
         const revoked = await this.isTokenRevoked(payload.jti)
killedBy: AuthService refresh() issues a new access token for a valid refresh token
statusReason: UnauthorizedError: Invalid token type

[Killed] ConditionalExpression
src/application/services/AuthService.ts:103:13
         if (payload.type !== 'refresh') throw new UnauthorizedError('Invalid token type')
 
         const revoked = await this.isTokenRevoked(payload.jti)
-        if (revoked) throw new UnauthorizedError('Token has been revoked')
+        if (true) throw new UnauthorizedError('Token has been revoked')
 
         return { accessToken: await this.issueAccessToken(payload.sub, fingerprint) }
killedBy: AuthService refresh() issues a new access token for a valid refresh token
statusReason: UnauthorizedError: Token has been revoked

[Killed] ConditionalExpression
src/application/services/AuthService.ts:103:13
         if (payload.type !== 'refresh') throw new UnauthorizedError('Invalid token type')
 
         const revoked = await this.isTokenRevoked(payload.jti)
-        if (revoked) throw new UnauthorizedError('Token has been revoked')
+        if (false) throw new UnauthorizedError('Token has been revoked')
 
         return { accessToken: await this.issueAccessToken(payload.sub, fingerprint) }
killedBy: AuthService refresh() throws UnauthorizedError if refresh token is revoked
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"accessToken": "signed-token"}

[Killed] BlockStatement
src/application/services/AuthService.ts:111:46
     // ===========================================================================
     // Logout
     // ===========================================================================
-    async logout(jti: string): Promise<void> {
-        const expiresAt = new Date(Date.now() + 15 * 60 * 1000)
-        await this.tokenRepo.revoke(jti, expiresAt)
-    }
+    async logout(jti: string): Promise<void> {}
 
     // ===========================================================================
killedBy: AuthService logout() revokes the token via repository
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "some-jti", Any<Date>

Number of calls: 0

[Killed] ArithmeticOperator
src/application/services/AuthService.ts:112:36
     // Logout
     // ===========================================================================
     async logout(jti: string): Promise<void> {
-        const expiresAt = new Date(Date.now() + 15 * 60 * 1000)
+        const expiresAt = new Date(Date.now() - 15 * 60 * 1000)
         await this.tokenRepo.revoke(jti, expiresAt)
     }
killedBy: AuthService logout() sets expiry to 15 minutes from now
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1779940235778
Received:    1779938435878

[Killed] ArithmeticOperator
src/application/services/AuthService.ts:112:49
     // Logout
     // ===========================================================================
     async logout(jti: string): Promise<void> {
-        const expiresAt = new Date(Date.now() + 15 * 60 * 1000)
+        const expiresAt = new Date(Date.now() + 15 / 60 * 1000)
         await this.tokenRepo.revoke(jti, expiresAt)
     }
killedBy: AuthService logout() sets expiry to 15 minutes from now
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1779940236337
Received:    1779939336687

[Killed] BlockStatement
src/application/services/AuthService.ts:119:94
     // ===========================================================================
     // Verify Access Token
     // ===========================================================================
-    async verifyAccessToken(token: string, fingerprint: string): Promise<AccessTokenPayload> {
-        let payload: AccessTokenPayload
-
-        try {
-            payload = await this.jwt.verifyAsync<AccessTokenPayload>(token)
-        } catch {
-            throw new UnauthorizedError('Invalid or expired token')
-        }
-
-        const revoked = await this.isTokenRevoked(payload.jti)
-        if (revoked) throw new UnauthorizedError('Token has been revoked')
-
-        if (this.shouldEnforceFingerprint() && payload.fingerprint !== fingerprint) {
-            throw new UnauthorizedError('Token fingerprint mismatch')
-        }
-
-        return payload
-    }
+    async verifyAccessToken(token: string, fingerprint: string): Promise<AccessTokenPayload> {}
 
     // ===========================================================================
killedBy: AuthService verifyAccessToken() returns payload for a valid non-revoked token
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"aud": "portfolio-admin", "fingerprint": "test-fingerprint", "iss": "portfolio-api", "jti": "test-jti", "role": "admin", "sub": 1}
Received: undefined

[Killed] BlockStatement
src/application/services/AuthService.ts:122:13
     async verifyAccessToken(token: string, fingerprint: string): Promise<AccessTokenPayload> {
         let payload: AccessTokenPayload
 
-        try {
-            payload = await this.jwt.verifyAsync<AccessTokenPayload>(token)
-        } catch {
+        try {} catch {
             throw new UnauthorizedError('Invalid or expired token')
         }
killedBy: AuthService verifyAccessToken() returns payload for a valid non-revoked token
statusReason: TypeError: Cannot read properties of undefined (reading 'jti')

[Killed] BlockStatement
src/application/services/AuthService.ts:124:17
 
         try {
             payload = await this.jwt.verifyAsync<AccessTokenPayload>(token)
-        } catch {
-            throw new UnauthorizedError('Invalid or expired token')
-        }
+        } catch {}
 
         const revoked = await this.isTokenRevoked(payload.jti)
killedBy: AuthService verifyAccessToken() throws UnauthorizedError if JWT verification fails
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: UnauthorizedError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'jti')"

      205 |         }

[Killed] ConditionalExpression
src/application/services/AuthService.ts:131:48
         const revoked = await this.isTokenRevoked(payload.jti)
         if (revoked) throw new UnauthorizedError('Token has been revoked')
 
-        if (this.shouldEnforceFingerprint() && payload.fingerprint !== fingerprint) {
+        if (this.shouldEnforceFingerprint() && true) {
             throw new UnauthorizedError('Token fingerprint mismatch')
         }
killedBy: AuthService verifyAccessToken() returns payload for a valid non-revoked token
statusReason: UnauthorizedError: Token fingerprint mismatch

[Killed] BlockStatement
src/application/services/AuthService.ts:131:85
         const revoked = await this.isTokenRevoked(payload.jti)
         if (revoked) throw new UnauthorizedError('Token has been revoked')
 
-        if (this.shouldEnforceFingerprint() && payload.fingerprint !== fingerprint) {
-            throw new UnauthorizedError('Token fingerprint mismatch')
-        }
+        if (this.shouldEnforceFingerprint() && payload.fingerprint !== fingerprint) {}
 
         return payload
killedBy: AuthService verifyAccessToken() throws UnauthorizedError on fingerprint mismatch when strict mode is on
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"aud": "portfolio-admin", "fingerprint": "original-fp", "iss": "portfolio-api", "jti": "test-jti", "role": "admin", "sub": 1}

[Killed] BlockStatement
src/application/services/AuthService.ts:141:65
     // ===========================================================================
     // Cached Revocation Check
     // ===========================================================================
-    private async isTokenRevoked(jti: string): Promise<boolean> {
-        return this.cacheQuery.getOrSetWithProfile(
-            `revoked-token:${jti}`,
-            'SHORT',  // ← was REALTIME (10s fresh), now SHORT (60s fresh)
-            async () => await this.tokenRepo.isRevoked(jti),
-        )
-    }
+    private async isTokenRevoked(jti: string): Promise<boolean> {}
     
     private shouldEnforceFingerprint(): boolean {
killedBy: AuthService verifyAccessToken() throws UnauthorizedError if token is revoked
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"aud": "portfolio-admin", "fingerprint": "test-fingerprint", "iss": "portfolio-api", "jti": "test-jti", "role": "admin", "sub": 1}

[Survived] ArrowFunction
src/application/services/AuthService.ts:145:13
         return this.cacheQuery.getOrSetWithProfile(
             `revoked-token:${jti}`,
             'SHORT',  // ← was REALTIME (10s fresh), now SHORT (60s fresh)
-            async () => await this.tokenRepo.isRevoked(jti),
+            () => undefined,
         )
     }

[Killed] BlockStatement
src/application/services/AuthService.ts:149:49
         )
     }
     
-    private shouldEnforceFingerprint(): boolean {
-        return process.env.FINGERPRINT_STRICT !== 'false'
-    }
+    private shouldEnforceFingerprint(): boolean {}
 
     // ===========================================================================
killedBy: AuthService verifyAccessToken() throws UnauthorizedError on fingerprint mismatch when strict mode is on
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"aud": "portfolio-admin", "fingerprint": "original-fp", "iss": "portfolio-api", "jti": "test-jti", "role": "admin", "sub": 1}

[Killed] EqualityOperator
src/application/services/AuthService.ts:150:16
     }
     
     private shouldEnforceFingerprint(): boolean {
-        return process.env.FINGERPRINT_STRICT !== 'false'
+        return process.env.FINGERPRINT_STRICT === 'false'
     }
 
killedBy: AuthService verifyAccessToken() throws UnauthorizedError on fingerprint mismatch when strict mode is on
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"aud": "portfolio-admin", "fingerprint": "original-fp", "iss": "portfolio-api", "jti": "test-jti", "role": "admin", "sub": 1}

[Killed] ConditionalExpression
src/application/services/AuthService.ts:150:16
     }
     
     private shouldEnforceFingerprint(): boolean {
-        return process.env.FINGERPRINT_STRICT !== 'false'
+        return true
     }
 
killedBy: AuthService verifyAccessToken() does not enforce fingerprint when FINGERPRINT_STRICT is false
statusReason: UnauthorizedError: Token fingerprint mismatch

[Killed] BlockStatement
src/application/services/AuthService.ts:156:68
     // ===========================================================================
     // Static Helpers (Used by Controller)
     // ===========================================================================
-    static buildFingerprint(userAgent: string, ip: string): string {
-        return crypto
-            .createHash('sha256')
-            .update(`${userAgent}:${ip}`)
-            .digest('hex')
-    }
+    static buildFingerprint(userAgent: string, ip: string): string {}
 
     static getRefreshTokenExpiryMs(): number {
killedBy: AuthService buildFingerprint() returns a consistent SHA-256 hex string
statusReason: TypeError: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] StringLiteral
src/application/services/AuthService.ts:160:21
         return crypto
             .createHash('sha256')
             .update(`${userAgent}:${ip}`)
-            .digest('hex')
+            .digest("")
     }
 
killedBy: AuthService buildFingerprint() returns a consistent SHA-256 hex string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: {"data": [39, 157, 6, 231, 40, 124, 145, 136, 171, 103, …], "type": "Buffer"}
Received: serializes to the same string

[Killed] BlockStatement
src/application/services/AuthService.ts:163:46
             .digest('hex')
     }
 
-    static getRefreshTokenExpiryMs(): number {
-        return AuthService.REFRESH_TOKEN_EXPIRY_MS
-    }
+    static getRefreshTokenExpiryMs(): number {}
 
     // ===========================================================================
killedBy: AuthService getRefreshTokenExpiryMs() returns 7 days in milliseconds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 604800000
Received: undefined

[Killed] BlockStatement
src/application/services/AuthService.ts:170:90
     // ===========================================================================
     // Token Issuers
     // ===========================================================================
-    private async issueAccessToken(userId: number, fingerprint: string): Promise<string> {
-        const jti = crypto.randomUUID()
-
-        return this.jwt.signAsync(
-            { sub: userId, role: 'admin' as const, jti, fingerprint },
-            { expiresIn: AuthService.ACCESS_TOKEN_EXPIRY },
-        )
-    }
+    private async issueAccessToken(userId: number, fingerprint: string): Promise<string> {}
 
     private async issueRefreshToken(userId: number): Promise<string> {
killedBy: AuthService login() returns access and refresh tokens on valid credentials
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] BlockStatement
src/application/services/AuthService.ts:179:70
         )
     }
 
-    private async issueRefreshToken(userId: number): Promise<string> {
-        const jti = crypto.randomUUID()
-
-        return this.jwt.signAsync(
-            { sub: userId, jti, type: 'refresh' as const },
-            { expiresIn: AuthService.REFRESH_TOKEN_EXPIRY },
-        )
-    }
+    private async issueRefreshToken(userId: number): Promise<string> {}
 }
killedBy: AuthService login() returns access and refresh tokens on valid credentials
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] ObjectLiteral
src/application/services/AuthService.ts:183:13
         const jti = crypto.randomUUID()
 
         return this.jwt.signAsync(
-            { sub: userId, jti, type: 'refresh' as const },
+            {},
             { expiresIn: AuthService.REFRESH_TOKEN_EXPIRY },
         )
killedBy: AuthService login() signs refresh token with correct claims
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"type": "refresh"}, ObjectContaining {"expiresIn": "7d"}
Received
       1: {"fingerprint": "fp", "jti": "9783c548-1f4d-4051-977f-8a98cfe54099", "role": "admin", "sub": 1}, {"expiresIn": "15m"}
       2: {}, {"expiresIn": "7d"}

Number of calls: 2
