[Killed] LogicalOperator
src/infrastructure/cache/CacheQueryService.ts:61:26
     ): Promise<T> {
         const namespacedKey = this.getNamespacedKey(key)
         const now = Date.now()
-        const staleTtl = options.staleTtl ?? ttl
+        const staleTtl = options.staleTtl && ttl
         const forceRefresh = options.forceRefresh ?? false
 
killedBy: CacheQueryService getOrSetWithProfile() uses correct TTL values for MEDIUM profile
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:my-key", ObjectContaining {"data": "data"}, 2280
Received: "portfolio:v1:my-key", {"data": "data", "expiresAt": 1779939719954, "staleUntil": 1779940019954}, 780

Number of calls: 1

[Killed] BooleanLiteral
src/infrastructure/cache/CacheQueryService.ts:62:54
         const namespacedKey = this.getNamespacedKey(key)
         const now = Date.now()
         const staleTtl = options.staleTtl ?? ttl
-        const forceRefresh = options.forceRefresh ?? false
+        const forceRefresh = options.forceRefresh ?? true
 
         if (forceRefresh) {
killedBy: CacheQueryService getOrSet() — cache hits returns cached data immediately on a fresh hit without calling factory
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "cached-value"
Received: undefined

[Killed] LogicalOperator
src/infrastructure/cache/CacheQueryService.ts:62:30
         const namespacedKey = this.getNamespacedKey(key)
         const now = Date.now()
         const staleTtl = options.staleTtl ?? ttl
-        const forceRefresh = options.forceRefresh ?? false
+        const forceRefresh = options.forceRefresh && false
 
         if (forceRefresh) {
killedBy: CacheQueryService getOrSet() — forceRefresh bypasses cache and calls factory when forceRefresh is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "forced-data"
Received: "cached-data"

[Killed] ConditionalExpression
src/infrastructure/cache/CacheQueryService.ts:64:13
         const staleTtl = options.staleTtl ?? ttl
         const forceRefresh = options.forceRefresh ?? false
 
-        if (forceRefresh) {
+        if (false) {
         return this.refreshAndStore(namespacedKey, ttl, staleTtl, factory, options.retries)
         }
killedBy: CacheQueryService getOrSet() — forceRefresh bypasses cache and calls factory when forceRefresh is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "forced-data"
Received: "cached-data"

[Killed] ConditionalExpression
src/infrastructure/cache/CacheQueryService.ts:64:13
         const staleTtl = options.staleTtl ?? ttl
         const forceRefresh = options.forceRefresh ?? false
 
-        if (forceRefresh) {
+        if (true) {
         return this.refreshAndStore(namespacedKey, ttl, staleTtl, factory, options.retries)
         }
killedBy: CacheQueryService getOrSet() — cache hits returns cached data immediately on a fresh hit without calling factory
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "cached-value"
Received: undefined

[Killed] EqualityOperator
src/infrastructure/cache/CacheQueryService.ts:72:13
 
         if (cached) {
         // Fresh cache hit - fastest path
-        if (now < cached.expiresAt) {
+        if (now >= cached.expiresAt) {
             return cached.data
         }
killedBy: CacheQueryService getOrSet() — cache hits returns cached data immediately on a fresh hit without calling factory
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Killed] ConditionalExpression
src/infrastructure/cache/CacheQueryService.ts:72:13
 
         if (cached) {
         // Fresh cache hit - fastest path
-        if (now < cached.expiresAt) {
+        if (true) {
             return cached.data
         }
killedBy: CacheQueryService getOrSet() — cache hits returns stale data and triggers background refresh on stale hit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] EqualityOperator
src/infrastructure/cache/CacheQueryService.ts:77:13
         }
 
         // Stale-While-Revalidate: serve stale data + refresh in background
-        if (now < cached.staleUntil) {
+        if (now >= cached.staleUntil) {
             void this.refreshInBackground(namespacedKey, ttl, staleTtl, factory)
             return cached.data
killedBy: CacheQueryService getOrSet() — cache hits returns stale data and triggers background refresh on stale hit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stale-value"
Received: "fresh-value"

[Killed] ConditionalExpression
src/infrastructure/cache/CacheQueryService.ts:77:13
         }
 
         // Stale-While-Revalidate: serve stale data + refresh in background
-        if (now < cached.staleUntil) {
+        if (false) {
             void this.refreshInBackground(namespacedKey, ttl, staleTtl, factory)
             return cached.data
killedBy: CacheQueryService getOrSet() — cache hits returns stale data and triggers background refresh on stale hit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stale-value"
Received: "fresh-value"

[Killed] BlockStatement
src/infrastructure/cache/CacheQueryService.ts:91:19
         key: string,
         profile: CacheProfile,
         factory: () => Promise<T>,
-    ): Promise<T> {
-        const config = CACHE_TTL[profile]
-        return this.getOrSet(key, config.fresh, factory, { staleTtl: config.stale })
-    }
+    ): Promise<T> {}
 
   // ===================================================================
killedBy: CacheQueryService getOrSetWithProfile() uses correct TTL values for MEDIUM profile
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:my-key", ObjectContaining {"data": "data"}, 2280

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/cache/CacheQueryService.ts:106:19
         staleTtl: number,
         factory: () => Promise<T>,
         retries = 2,
-    ): Promise<T> {
-        const data = await this.executeWithRetry(factory, retries)
-
-        const now = Date.now()
-        const envelope: CacheEnvelope<T> = {
-            data,
-            expiresAt: now + ttl * 1000,
-            staleUntil: now + (ttl + staleTtl) * 1000,
-        }
-
-        // Physical TTL includes stale window + safety buffer
-        await this.cache.set(key, envelope, ttl + staleTtl + 180)
-        return data
-    }
+    ): Promise<T> {}
 
     /**
killedBy: CacheQueryService getOrSet() — cache hits returns stale data and triggers background refresh on stale hit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ArithmeticOperator
src/infrastructure/cache/CacheQueryService.ts:112:24
         const now = Date.now()
         const envelope: CacheEnvelope<T> = {
             data,
-            expiresAt: now + ttl * 1000,
+            expiresAt: now - ttl * 1000,
             staleUntil: now + (ttl + staleTtl) * 1000,
         }
killedBy: CacheQueryService getOrSet() — cache miss stores envelope with correct expiresAt in the future
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 1779939438728
Received:   1779939378728

[Survived] ArithmeticOperator
src/infrastructure/cache/CacheQueryService.ts:112:30
         const now = Date.now()
         const envelope: CacheEnvelope<T> = {
             data,
-            expiresAt: now + ttl * 1000,
+            expiresAt: now + ttl / 1000,
             staleUntil: now + (ttl + staleTtl) * 1000,
         }

[Killed] ArithmeticOperator
src/infrastructure/cache/CacheQueryService.ts:113:31
         const envelope: CacheEnvelope<T> = {
             data,
             expiresAt: now + ttl * 1000,
-            staleUntil: now + (ttl + staleTtl) * 1000,
+            staleUntil: now + (ttl + staleTtl) / 1000,
         }
 
killedBy: CacheQueryService getOrSet() — cache miss stores envelope with staleUntil after expiresAt
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 1779939504543
Received:   1779939444543.36

[Killed] ArithmeticOperator
src/infrastructure/cache/CacheQueryService.ts:113:25
         const envelope: CacheEnvelope<T> = {
             data,
             expiresAt: now + ttl * 1000,
-            staleUntil: now + (ttl + staleTtl) * 1000,
+            staleUntil: now - (ttl + staleTtl) * 1000,
         }
 
killedBy: CacheQueryService getOrSet() — cache miss stores envelope with staleUntil after expiresAt
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 1779939501583
Received:   1779939081583

[Killed] ArithmeticOperator
src/infrastructure/cache/CacheQueryService.ts:117:45
         }
 
         // Physical TTL includes stale window + safety buffer
-        await this.cache.set(key, envelope, ttl + staleTtl + 180)
+        await this.cache.set(key, envelope, ttl - staleTtl + 180)
         return data
     }
killedBy: CacheQueryService getOrSetWithProfile() uses correct TTL values for MEDIUM profile
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:my-key", ObjectContaining {"data": "data"}, 2280
Received: "portfolio:v1:my-key", {"data": "data", "expiresAt": 1779939750300, "staleUntil": 1779941550300}, -1320

Number of calls: 1

[Killed] ArithmeticOperator
src/infrastructure/cache/CacheQueryService.ts:117:45
         }
 
         // Physical TTL includes stale window + safety buffer
-        await this.cache.set(key, envelope, ttl + staleTtl + 180)
+        await this.cache.set(key, envelope, ttl + staleTtl - 180)
         return data
     }
killedBy: CacheQueryService getOrSetWithProfile() uses correct TTL values for MEDIUM profile
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:my-key", ObjectContaining {"data": "data"}, 2280
Received: "portfolio:v1:my-key", {"data": "data", "expiresAt": 1779939749548, "staleUntil": 1779941549548}, 1920

Number of calls: 1

[Killed] BlockStatement
src/infrastructure/cache/CacheQueryService.ts:129:22
         ttl: number,
         staleTtl: number,
         factory: () => Promise<T>,
-    ): Promise<void> {
-        if (this.refreshing.has(key)) return
-
-        const promise = (async () => {
-            try {
-                await this.refreshAndStore(key, ttl, staleTtl, factory)
-            } catch (error) {
-                this.logger.error(`Background cache refresh failed for key: ${key}`, error)
-            } finally {
-                this.refreshing.delete(key) // ← Critical: Prevents memory leak
-            }
-        })()
-
-        this.refreshing.set(key, promise)
-    }
+    ): Promise<void> {}
 
   // ===================================================================
killedBy: CacheQueryService getOrSet() — cache hits returns stale data and triggers background refresh on stale hit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/cache/CacheQueryService.ts:130:13
         staleTtl: number,
         factory: () => Promise<T>,
     ): Promise<void> {
-        if (this.refreshing.has(key)) return
+        if (true) return
 
         const promise = (async () => {
killedBy: CacheQueryService getOrSet() — cache hits returns stale data and triggers background refresh on stale hit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] ConditionalExpression
src/infrastructure/cache/CacheQueryService.ts:130:13
         staleTtl: number,
         factory: () => Promise<T>,
     ): Promise<void> {
-        if (this.refreshing.has(key)) return
+        if (false) return
 
         const promise = (async () => {

[Killed] BlockStatement
src/infrastructure/cache/CacheQueryService.ts:132:38
     ): Promise<void> {
         if (this.refreshing.has(key)) return
 
-        const promise = (async () => {
-            try {
-                await this.refreshAndStore(key, ttl, staleTtl, factory)
-            } catch (error) {
-                this.logger.error(`Background cache refresh failed for key: ${key}`, error)
-            } finally {
-                this.refreshing.delete(key) // ← Critical: Prevents memory leak
-            }
-        })()
+        const promise = (async () => {})()
 
         this.refreshing.set(key, promise)
killedBy: CacheQueryService getOrSet() — cache hits returns stale data and triggers background refresh on stale hit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/infrastructure/cache/CacheQueryService.ts:133:17
         if (this.refreshing.has(key)) return
 
         const promise = (async () => {
-            try {
-                await this.refreshAndStore(key, ttl, staleTtl, factory)
-            } catch (error) {
+            try {} catch (error) {
                 this.logger.error(`Background cache refresh failed for key: ${key}`, error)
             } finally {
killedBy: CacheQueryService getOrSet() — cache hits returns stale data and triggers background refresh on stale hit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[NoCoverage] BlockStatement
src/infrastructure/cache/CacheQueryService.ts:135:29
         const promise = (async () => {
             try {
                 await this.refreshAndStore(key, ttl, staleTtl, factory)
-            } catch (error) {
-                this.logger.error(`Background cache refresh failed for key: ${key}`, error)
-            } finally {
+            } catch (error) {} finally {
                 this.refreshing.delete(key) // ← Critical: Prevents memory leak
             }

[Survived] BlockStatement
src/infrastructure/cache/CacheQueryService.ts:137:23
                 await this.refreshAndStore(key, ttl, staleTtl, factory)
             } catch (error) {
                 this.logger.error(`Background cache refresh failed for key: ${key}`, error)
-            } finally {
-                this.refreshing.delete(key) // ← Critical: Prevents memory leak
-            }
+            } finally {}
         })()
 

[Killed] BlockStatement
src/infrastructure/cache/CacheQueryService.ts:149:46
   // DELETION METHODS
   // ===================================================================
 
-    async delete(key: string): Promise<void> {
-        const namespacedKey = this.getNamespacedKey(key)
-        await this.cache.del(namespacedKey)
-    }
+    async delete(key: string): Promise<void> {}
 
     async deletePattern(pattern: string): Promise<void> {
killedBy: CacheQueryService delete() deletes with namespaced key
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "portfolio:v1:blog:list"

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/cache/CacheQueryService.ts:154:57
         await this.cache.del(namespacedKey)
     }
 
-    async deletePattern(pattern: string): Promise<void> {
-        const namespacedPattern = this.getNamespacedKey(pattern)
-        try {
-        const store = (this.cache as any).store
-        if (store?.keys) {
-            const keys = await store.keys(namespacedPattern)
-            if (keys?.length) {
-            await Promise.all(keys.map((k: string) => this.cache.del(k)))
-            }
-        } else {
-            await this.delete(pattern)
-        }
-        } catch (error) {
-        this.logger.warn(`Pattern deletion failed for ${pattern}`, error)
-        await this.delete(pattern)
-        }
-    }
+    async deletePattern(pattern: string): Promise<void> {}
 
     async clear(): Promise<void> {
killedBy: CacheQueryService deletePattern() deletes all keys matching pattern
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Killed] BlockStatement
src/infrastructure/cache/CacheQueryService.ts:156:13
 
     async deletePattern(pattern: string): Promise<void> {
         const namespacedPattern = this.getNamespacedKey(pattern)
-        try {
-        const store = (this.cache as any).store
-        if (store?.keys) {
-            const keys = await store.keys(namespacedPattern)
-            if (keys?.length) {
-            await Promise.all(keys.map((k: string) => this.cache.del(k)))
-            }
-        } else {
-            await this.delete(pattern)
-        }
-        } catch (error) {
+        try {} catch (error) {
         this.logger.warn(`Pattern deletion failed for ${pattern}`, error)
         await this.delete(pattern)
killedBy: CacheQueryService deletePattern() deletes all keys matching pattern
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Killed] BlockStatement
src/infrastructure/cache/CacheQueryService.ts:158:26
         const namespacedPattern = this.getNamespacedKey(pattern)
         try {
         const store = (this.cache as any).store
-        if (store?.keys) {
-            const keys = await store.keys(namespacedPattern)
-            if (keys?.length) {
-            await Promise.all(keys.map((k: string) => this.cache.del(k)))
-            }
-        } else {
+        if (store?.keys) {} else {
             await this.delete(pattern)
         }
killedBy: CacheQueryService deletePattern() deletes all keys matching pattern
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/cache/CacheQueryService.ts:158:13
         const namespacedPattern = this.getNamespacedKey(pattern)
         try {
         const store = (this.cache as any).store
-        if (store?.keys) {
+        if (false) {
             const keys = await store.keys(namespacedPattern)
             if (keys?.length) {
killedBy: CacheQueryService deletePattern() deletes all keys matching pattern
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] BlockStatement
src/infrastructure/cache/CacheQueryService.ts:160:31
         const store = (this.cache as any).store
         if (store?.keys) {
             const keys = await store.keys(namespacedPattern)
-            if (keys?.length) {
-            await Promise.all(keys.map((k: string) => this.cache.del(k)))
-            }
+            if (keys?.length) {}
         } else {
             await this.delete(pattern)
killedBy: CacheQueryService deletePattern() deletes all keys matching pattern
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/cache/CacheQueryService.ts:160:17
         const store = (this.cache as any).store
         if (store?.keys) {
             const keys = await store.keys(namespacedPattern)
-            if (keys?.length) {
+            if (false) {
             await Promise.all(keys.map((k: string) => this.cache.del(k)))
             }
killedBy: CacheQueryService deletePattern() deletes all keys matching pattern
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Killed] ArrowFunction
src/infrastructure/cache/CacheQueryService.ts:161:40
         if (store?.keys) {
             const keys = await store.keys(namespacedPattern)
             if (keys?.length) {
-            await Promise.all(keys.map((k: string) => this.cache.del(k)))
+            await Promise.all(keys.map(() => undefined))
             }
         } else {
killedBy: CacheQueryService deletePattern() deletes all keys matching pattern
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[NoCoverage] BlockStatement
src/infrastructure/cache/CacheQueryService.ts:163:16
             if (keys?.length) {
             await Promise.all(keys.map((k: string) => this.cache.del(k)))
             }
-        } else {
-            await this.delete(pattern)
-        }
+        } else {}
         } catch (error) {
         this.logger.warn(`Pattern deletion failed for ${pattern}`, error)

[NoCoverage] BlockStatement
src/infrastructure/cache/CacheQueryService.ts:166:25
         } else {
             await this.delete(pattern)
         }
-        } catch (error) {
-        this.logger.warn(`Pattern deletion failed for ${pattern}`, error)
-        await this.delete(pattern)
-        }
+        } catch (error) {}
     }
 

[NoCoverage] StringLiteral
src/infrastructure/cache/CacheQueryService.ts:167:26
             await this.delete(pattern)
         }
         } catch (error) {
-        this.logger.warn(`Pattern deletion failed for ${pattern}`, error)
+        this.logger.warn(``, error)
         await this.delete(pattern)
         }

[NoCoverage] BlockStatement
src/infrastructure/cache/CacheQueryService.ts:172:34
         }
     }
 
-    async clear(): Promise<void> {
-        await this.cache.clear?.()
-        this.logger.warn('Cache cleared entirely')
-    }
+    async clear(): Promise<void> {}
 
   // ===================================================================

[NoCoverage] OptionalChaining
src/infrastructure/cache/CacheQueryService.ts:173:15
     }
 
     async clear(): Promise<void> {
-        await this.cache.clear?.()
+        await this.cache.clear()
         this.logger.warn('Cache cleared entirely')
     }

[NoCoverage] StringLiteral
src/infrastructure/cache/CacheQueryService.ts:174:26
 
     async clear(): Promise<void> {
         await this.cache.clear?.()
-        this.logger.warn('Cache cleared entirely')
+        this.logger.warn("")
     }
 

[Killed] BlockStatement
src/infrastructure/cache/CacheQueryService.ts:185:19
         fn: () => Promise<T>,
         retries: number,
         baseDelay = 300,
-    ): Promise<T> {
-        let lastError: unknown
-
-        for (let attempt = 1; attempt <= retries + 1; attempt++) {
-        try {
-            return await fn()
-        } catch (error) {
-            lastError = error
-            if (attempt > retries) break
-
-            const delay = baseDelay * attempt
-            await new Promise(resolve => setTimeout(resolve, delay))
-        }
-        }
-
-        throw lastError
-    }
+    ): Promise<T> {}
 }
killedBy: CacheQueryService getOrSet() — cache hits returns stale data and triggers background refresh on stale hit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ArithmeticOperator
src/infrastructure/cache/CacheQueryService.ts:188:42
     ): Promise<T> {
         let lastError: unknown
 
-        for (let attempt = 1; attempt <= retries + 1; attempt++) {
+        for (let attempt = 1; attempt <= retries - 1; attempt++) {
         try {
             return await fn()
killedBy: CacheQueryService retry logic retries factory on failure and succeeds on second attempt
statusReason: Error: thrown: undefined

[Killed] EqualityOperator
src/infrastructure/cache/CacheQueryService.ts:188:31
     ): Promise<T> {
         let lastError: unknown
 
-        for (let attempt = 1; attempt <= retries + 1; attempt++) {
+        for (let attempt = 1; attempt < retries + 1; attempt++) {
         try {
             return await fn()
killedBy: CacheQueryService retry logic retries factory on failure and succeeds on second attempt
statusReason: Error: DB timeout

[Killed] BlockStatement
src/infrastructure/cache/CacheQueryService.ts:189:13
         let lastError: unknown
 
         for (let attempt = 1; attempt <= retries + 1; attempt++) {
-        try {
-            return await fn()
-        } catch (error) {
+        try {} catch (error) {
             lastError = error
             if (attempt > retries) break
killedBy: CacheQueryService getOrSet() — cache hits returns stale data and triggers background refresh on stale hit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/infrastructure/cache/CacheQueryService.ts:191:25
         for (let attempt = 1; attempt <= retries + 1; attempt++) {
         try {
             return await fn()
-        } catch (error) {
-            lastError = error
-            if (attempt > retries) break
-
-            const delay = baseDelay * attempt
-            await new Promise(resolve => setTimeout(resolve, delay))
-        }
+        } catch (error) {}
         }
 
killedBy: CacheQueryService retry logic throws after all retries are exhausted
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Persistent failure"

Received function did not throw

[Killed] EqualityOperator
src/infrastructure/cache/CacheQueryService.ts:193:17
             return await fn()
         } catch (error) {
             lastError = error
-            if (attempt > retries) break
+            if (attempt >= retries) break
 
             const delay = baseDelay * attempt
killedBy: CacheQueryService retry logic retries factory on failure and succeeds on second attempt
statusReason: Error: DB timeout

[Killed] ConditionalExpression
src/infrastructure/cache/CacheQueryService.ts:193:17
             return await fn()
         } catch (error) {
             lastError = error
-            if (attempt > retries) break
+            if (true) break
 
             const delay = baseDelay * attempt
killedBy: CacheQueryService retry logic retries factory on failure and succeeds on second attempt
statusReason: Error: DB timeout

[Killed] ArithmeticOperator
src/infrastructure/cache/CacheQueryService.ts:195:27
             lastError = error
             if (attempt > retries) break
 
-            const delay = baseDelay * attempt
+            const delay = baseDelay / attempt
             await new Promise(resolve => setTimeout(resolve, delay))
         }
killedBy: CacheQueryService retry logic uses increasing delay between retries — not decreasing
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 304
Received:   156

[Timeout] ArrowFunction
src/infrastructure/cache/CacheQueryService.ts:196:31
             if (attempt > retries) break
 
             const delay = baseDelay * attempt
-            await new Promise(resolve => setTimeout(resolve, delay))
+            await new Promise(() => undefined)
         }
         }
