[Killed] ObjectLiteral
src/application/services/AuthService.ts:184:13
 
         return this.jwt.signAsync(
             { sub: userId, jti, type: 'refresh' as const },
-            { expiresIn: AuthService.REFRESH_TOKEN_EXPIRY },
+            {},
         )
     }
killedBy: AuthService login() signs refresh token with correct claims
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"type": "refresh"}, ObjectContaining {"expiresIn": "7d"}
Received
       1: {"fingerprint": "fp", "jti": "60701588-653b-4e2c-9939-de1cc6534a94", "role": "admin", "sub": 1}, {"expiresIn": "15m"}
       2: {"jti": "2bd6e2a0-4969-4ad8-bbdf-6195a4355f2a", "sub": 1, "type": "refresh"}, {}

Number of calls: 2
