[Killed] BlockStatement
use-cases/commands/blog/CreateBlogCommand.ts:32:32
         tags?:       string[]
         isPublished: boolean
         userId:      number
-    }): Promise<BlogDetailDTO> {
-        const slug = Slug.from(input.title)
-
-        const blog = await this.repo.create({
-            title:       input.title,
-            slug:        slug.toString(),
-            content:     input.content,
-            excerpt:     input.excerpt ?? null,
-            tags:        input.tags ?? [],
-            isPublished: input.isPublished,
-            publishedAt: input.isPublished ? new Date() : null,
-            userId:      input.userId,
-        })
-
-        // Cache invalidation
-        await this.cacheService.invalidatePublicBlogs()
-        if (input.isPublished) {
-            await this.cacheService.invalidateBlogBySlug(slug.toString())
-        }
-
-        return BlogMapper.toDetailDTO(blog)
-    }
+    }): Promise<BlogDetailDTO> {}
 }
killedBy: CreateBlogCommand slug generation generates slug from title and passes it to repo
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"slug": "my-first-blog-post"}

Number of calls: 0

[Killed] LogicalOperator
use-cases/commands/blog/CreateBlogCommand.ts:39:26
             title:       input.title,
             slug:        slug.toString(),
             content:     input.content,
-            excerpt:     input.excerpt ?? null,
+            excerpt:     input.excerpt && null,
             tags:        input.tags ?? [],
             isPublished: input.isPublished,
killedBy: CreateBlogCommand optional fields defaults excerpt to null when not provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"excerpt": null}
Received: {"content": "This is the content of the blog post.", "excerpt": undefined, "isPublished": false, "publishedAt": null, "slug": "my-first-blog-post", "tags": ["nestjs", "typescript"], "title": "My First Blog Post", "userId": 1}

Number of calls: 1

[Killed] LogicalOperator
use-cases/commands/blog/CreateBlogCommand.ts:40:26
             slug:        slug.toString(),
             content:     input.content,
             excerpt:     input.excerpt ?? null,
-            tags:        input.tags ?? [],
+            tags:        input.tags && [],
             isPublished: input.isPublished,
             publishedAt: input.isPublished ? new Date() : null,
killedBy: CreateBlogCommand optional fields defaults tags to empty array when not provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"tags": []}
Received: {"content": "This is the content of the blog post.", "excerpt": "Short excerpt", "isPublished": false, "publishedAt": null, "slug": "my-first-blog-post", "tags": undefined, "title": "My First Blog Post", "userId": 1}

Number of calls: 1

[Killed] ArrayDeclaration
use-cases/commands/blog/CreateBlogCommand.ts:40:40
             slug:        slug.toString(),
             content:     input.content,
             excerpt:     input.excerpt ?? null,
-            tags:        input.tags ?? [],
+            tags:        input.tags ?? ["Stryker was here"],
             isPublished: input.isPublished,
             publishedAt: input.isPublished ? new Date() : null,
killedBy: CreateBlogCommand optional fields defaults tags to empty array when not provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"tags": []}
Received: {"content": "This is the content of the blog post.", "excerpt": "Short excerpt", "isPublished": false, "publishedAt": null, "slug": "my-first-blog-post", "tags": ["Stryker was here"], "title": "My First Blog Post", "userId": 1}

Number of calls: 1

[Killed] ConditionalExpression
use-cases/commands/blog/CreateBlogCommand.ts:48:13
 
         // Cache invalidation
         await this.cacheService.invalidatePublicBlogs()
-        if (input.isPublished) {
+        if (true) {
             await this.cacheService.invalidateBlogBySlug(slug.toString())
         }
killedBy: CreateBlogCommand cache invalidation — draft blog does NOT invalidate slug cache for draft
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "my-first-blog-post"

[Killed] ConditionalExpression
use-cases/commands/blog/CreateBlogCommand.ts:48:13
 
         // Cache invalidation
         await this.cacheService.invalidatePublicBlogs()
-        if (input.isPublished) {
+        if (false) {
             await this.cacheService.invalidateBlogBySlug(slug.toString())
         }
killedBy: CreateBlogCommand cache invalidation — published blog invalidates slug cache when blog is published
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "my-published-post"

Number of calls: 0
