[Killed] BlockStatement
infrastructure/database/tasks/TokenCleanupTask.ts:15:47
     ) {}
 
     @Cron(CronExpression.EVERY_DAY_AT_2AM)
-    async handleTokenCleanup(): Promise<void> {
-        this.logger.log('Starting expired token cleanup...')
-        try {
-            await this.revokedTokenRepo.deleteExpired()
-            this.logger.log('Expired token cleanup complete')
-        } catch (error) {
-            this.logger.error(
-                `Token cleanup failed: ${(error as Error).message}`,
-                (error as Error).stack,
-            )
-        }
-    }
+    async handleTokenCleanup(): Promise<void> {}
 }
killedBy: TokenCleanupTask handleTokenCleanup() calls deleteExpired() on the repository
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
infrastructure/database/tasks/TokenCleanupTask.ts:16:25
 
     @Cron(CronExpression.EVERY_DAY_AT_2AM)
     async handleTokenCleanup(): Promise<void> {
-        this.logger.log('Starting expired token cleanup...')
+        this.logger.log("")
         try {
             await this.revokedTokenRepo.deleteExpired()
killedBy: TokenCleanupTask handleTokenCleanup() logs start message before running
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Starting expired token cleanup..."
Received
       1: "RootTestModule dependencies initialized"
       2: ""
       3: "Expired token cleanup complete"

[Killed] BlockStatement
infrastructure/database/tasks/TokenCleanupTask.ts:17:13
     @Cron(CronExpression.EVERY_DAY_AT_2AM)
     async handleTokenCleanup(): Promise<void> {
         this.logger.log('Starting expired token cleanup...')
-        try {
-            await this.revokedTokenRepo.deleteExpired()
-            this.logger.log('Expired token cleanup complete')
-        } catch (error) {
+        try {} catch (error) {
             this.logger.error(
                 `Token cleanup failed: ${(error as Error).message}`,
killedBy: TokenCleanupTask handleTokenCleanup() calls deleteExpired() on the repository
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
infrastructure/database/tasks/TokenCleanupTask.ts:20:25
         try {
             await this.revokedTokenRepo.deleteExpired()
             this.logger.log('Expired token cleanup complete')
-        } catch (error) {
-            this.logger.error(
-                `Token cleanup failed: ${(error as Error).message}`,
-                (error as Error).stack,
-            )
-        }
+        } catch (error) {}
     }
 }
killedBy: TokenCleanupTask handleTokenCleanup() — error handling logs error message containing the error detail
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "DB connection lost", Anything

Number of calls: 0

[Killed] StringLiteral
infrastructure/database/tasks/TokenCleanupTask.ts:22:17
             this.logger.log('Expired token cleanup complete')
         } catch (error) {
             this.logger.error(
-                `Token cleanup failed: ${(error as Error).message}`,
+                ``,
                 (error as Error).stack,
             )
killedBy: TokenCleanupTask handleTokenCleanup() — error handling logs error message containing the error detail
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "DB connection lost", Anything
Received: "", "Error: DB connection lost
