[Killed] BooleanLiteral
use-cases/commands/blog/UpdateBlogCommand.ts:41:13
         const { id, ...data } = input
 
         const existing = await this.readRepo.findById(id)
-        if (!existing) {
+        if (existing) {
             throw new NotFoundError(`Blog not found: ${id}`)
         }
killedBy: UpdateBlogCommand execute() — not found throws NotFoundError when blog does not exist
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: NotFoundError
Received constructor: TypeError

Received message: "Cannot read properties of null (reading 'slug')"

      100 |       // Always invalidate public list and the original slug

[Killed] ConditionalExpression
use-cases/commands/blog/UpdateBlogCommand.ts:41:13
         const { id, ...data } = input
 
         const existing = await this.readRepo.findById(id)
-        if (!existing) {
+        if (false) {
             throw new NotFoundError(`Blog not found: ${id}`)
         }
killedBy: UpdateBlogCommand execute() — not found throws NotFoundError when blog does not exist
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: NotFoundError
Received constructor: TypeError

Received message: "Cannot read properties of null (reading 'slug')"

      100 |       // Always invalidate public list and the original slug

[Survived] StringLiteral
use-cases/commands/blog/UpdateBlogCommand.ts:42:37
 
         const existing = await this.readRepo.findById(id)
         if (!existing) {
-            throw new NotFoundError(`Blog not found: ${id}`)
+            throw new NotFoundError(``)
         }
 

[Killed] LogicalOperator
use-cases/commands/blog/UpdateBlogCommand.ts:47:42
 
         // Auto-set publishedAt when publishing for the first time.
         // Spread into new object — avoids mutating the caller's input.
-        const payload: UpdateBlogInput = data.isPublished === true && !data.publishedAt
+        const payload: UpdateBlogInput = data.isPublished === true || !data.publishedAt
             ? { ...data, publishedAt: new Date() }
             : { ...data }
killedBy: UpdateBlogCommand execute() — publishedAt handling does not override publishedAt if already set
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1, ObjectContaining {"publishedAt": 2025-01-01T00:00:00.000Z}
Received: 1, {"content": "Updated content", "isPublished": true, "publishedAt": 2026-05-28T03:35:50.719Z, "title": "Updated Title"}

Number of calls: 1

[Killed] BooleanLiteral
use-cases/commands/blog/UpdateBlogCommand.ts:47:71
 
         // Auto-set publishedAt when publishing for the first time.
         // Spread into new object — avoids mutating the caller's input.
-        const payload: UpdateBlogInput = data.isPublished === true && !data.publishedAt
+        const payload: UpdateBlogInput = data.isPublished === true && data.publishedAt
             ? { ...data, publishedAt: new Date() }
             : { ...data }
killedBy: UpdateBlogCommand execute() — publishedAt handling auto-sets publishedAt when publishing for first time
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1, ObjectContaining {"publishedAt": Any<Date>}
Received: 1, {"content": "Updated content", "isPublished": true, "publishedAt": undefined, "title": "Updated Title"}

Number of calls: 1

[Killed] ObjectLiteral
use-cases/commands/blog/UpdateBlogCommand.ts:48:15
         // Auto-set publishedAt when publishing for the first time.
         // Spread into new object — avoids mutating the caller's input.
         const payload: UpdateBlogInput = data.isPublished === true && !data.publishedAt
-            ? { ...data, publishedAt: new Date() }
+            ? {}
             : { ...data }
 
killedBy: UpdateBlogCommand execute() — publishedAt handling auto-sets publishedAt when publishing for first time
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1, ObjectContaining {"publishedAt": Any<Date>}
Received: 1, {}

Number of calls: 1

[Killed] EqualityOperator
use-cases/commands/blog/UpdateBlogCommand.ts:58:13
         await this.cacheService.invalidateBlogBySlug(existing.slug)
 
         // Invalidate new slug if it changed — both old and new must be cleared
-        if (existing.slug !== updatedBlog.slug) {
+        if (existing.slug === updatedBlog.slug) {
             await this.cacheService.invalidateBlogBySlug(updatedBlog.slug)
         }
killedBy: UpdateBlogCommand execute() — cache invalidation, slug unchanged does not double-invalidate when slug is unchanged
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] ConditionalExpression
use-cases/commands/blog/UpdateBlogCommand.ts:58:13
         await this.cacheService.invalidateBlogBySlug(existing.slug)
 
         // Invalidate new slug if it changed — both old and new must be cleared
-        if (existing.slug !== updatedBlog.slug) {
+        if (false) {
             await this.cacheService.invalidateBlogBySlug(updatedBlog.slug)
         }
killedBy: UpdateBlogCommand execute() — cache invalidation, slug changed invalidates both old and new slug when slug changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "brand-new-slug"
Received: "original-title"

Number of calls: 1
