[Killed] BooleanLiteral
use-cases/commands/contact/SubmitContactCommand.ts:53:9
   async execute(input: SubmitContactInput): Promise<void> {
     // 1. Turnstile verification (anti-bot)
     const isHuman = await this.turnstile.verifyToken(input.turnstileToken)
-    if (!isHuman) {
+    if (isHuman) {
       throw new ValidationError('Turnstile verification failed. Please try again.')
     }
killedBy: SubmitContactCommand execute() — happy path saves to DB and emits event on valid input
statusReason: ValidationError: Turnstile verification failed. Please try again.

[Killed] BlockStatement
use-cases/commands/contact/SubmitContactCommand.ts:53:19
   async execute(input: SubmitContactInput): Promise<void> {
     // 1. Turnstile verification (anti-bot)
     const isHuman = await this.turnstile.verifyToken(input.turnstileToken)
-    if (!isHuman) {
-      throw new ValidationError('Turnstile verification failed. Please try again.')
-    }
+    if (!isHuman) {}
 
     // 2. Input validation & sanitization — limits mirror DB schema constraints
killedBy: SubmitContactCommand execute() — Turnstile throws ValidationError when Turnstile fails
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
use-cases/commands/contact/SubmitContactCommand.ts:58:41
     }
 
     // 2. Input validation & sanitization — limits mirror DB schema constraints
-    if (input.name.trim().length === 0) {
-      throw new ValidationError('Name is required')
-    }
+    if (input.name.trim().length === 0) {}
     if (input.name.length > MAX_NAME_LENGTH) {
       throw new ValidationError(`Name is too long (max ${MAX_NAME_LENGTH} characters)`)
killedBy: SubmitContactCommand execute() — name validation throws ValidationError for empty name
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
use-cases/commands/contact/SubmitContactCommand.ts:58:9
     }
 
     // 2. Input validation & sanitization — limits mirror DB schema constraints
-    if (input.name.trim().length === 0) {
+    if (false) {
       throw new ValidationError('Name is required')
     }
killedBy: SubmitContactCommand execute() — name validation throws ValidationError for empty name
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] StringLiteral
use-cases/commands/contact/SubmitContactCommand.ts:59:33
 
     // 2. Input validation & sanitization — limits mirror DB schema constraints
     if (input.name.trim().length === 0) {
-      throw new ValidationError('Name is required')
+      throw new ValidationError("")
     }
     if (input.name.length > MAX_NAME_LENGTH) {

[Killed] ConditionalExpression
use-cases/commands/contact/SubmitContactCommand.ts:61:9
     if (input.name.trim().length === 0) {
       throw new ValidationError('Name is required')
     }
-    if (input.name.length > MAX_NAME_LENGTH) {
+    if (false) {
       throw new ValidationError(`Name is too long (max ${MAX_NAME_LENGTH} characters)`)
     }
killedBy: SubmitContactCommand execute() — name validation throws ValidationError for name exceeding 60 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
use-cases/commands/contact/SubmitContactCommand.ts:61:46
     if (input.name.trim().length === 0) {
       throw new ValidationError('Name is required')
     }
-    if (input.name.length > MAX_NAME_LENGTH) {
-      throw new ValidationError(`Name is too long (max ${MAX_NAME_LENGTH} characters)`)
-    }
+    if (input.name.length > MAX_NAME_LENGTH) {}
     if (input.message.trim().length === 0) {
       throw new ValidationError('Message is required')
killedBy: SubmitContactCommand execute() — name validation throws ValidationError for name exceeding 60 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
use-cases/commands/contact/SubmitContactCommand.ts:64:44
     if (input.name.length > MAX_NAME_LENGTH) {
       throw new ValidationError(`Name is too long (max ${MAX_NAME_LENGTH} characters)`)
     }
-    if (input.message.trim().length === 0) {
-      throw new ValidationError('Message is required')
-    }
+    if (input.message.trim().length === 0) {}
     if (input.message.length > MAX_MESSAGE_LENGTH) {
       throw new ValidationError(`Message is too long (max ${MAX_MESSAGE_LENGTH} characters)`)
killedBy: SubmitContactCommand execute() — message validation throws ValidationError for empty message
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
use-cases/commands/contact/SubmitContactCommand.ts:64:9
     if (input.name.length > MAX_NAME_LENGTH) {
       throw new ValidationError(`Name is too long (max ${MAX_NAME_LENGTH} characters)`)
     }
-    if (input.message.trim().length === 0) {
+    if (input.message.trim().length !== 0) {
       throw new ValidationError('Message is required')
     }
killedBy: SubmitContactCommand execute() — happy path saves to DB and emits event on valid input
statusReason: ValidationError: Message is required

[Survived] StringLiteral
use-cases/commands/contact/SubmitContactCommand.ts:65:33
       throw new ValidationError(`Name is too long (max ${MAX_NAME_LENGTH} characters)`)
     }
     if (input.message.trim().length === 0) {
-      throw new ValidationError('Message is required')
+      throw new ValidationError("")
     }
     if (input.message.length > MAX_MESSAGE_LENGTH) {

[Killed] ConditionalExpression
use-cases/commands/contact/SubmitContactCommand.ts:67:9
     if (input.message.trim().length === 0) {
       throw new ValidationError('Message is required')
     }
-    if (input.message.length > MAX_MESSAGE_LENGTH) {
+    if (true) {
       throw new ValidationError(`Message is too long (max ${MAX_MESSAGE_LENGTH} characters)`)
     }
killedBy: SubmitContactCommand execute() — happy path saves to DB and emits event on valid input
statusReason: ValidationError: Message is too long (max 300 characters)

[Killed] BlockStatement
use-cases/commands/contact/SubmitContactCommand.ts:67:52
     if (input.message.trim().length === 0) {
       throw new ValidationError('Message is required')
     }
-    if (input.message.length > MAX_MESSAGE_LENGTH) {
-      throw new ValidationError(`Message is too long (max ${MAX_MESSAGE_LENGTH} characters)`)
-    }
+    if (input.message.length > MAX_MESSAGE_LENGTH) {}
 
     // 3. Email validation via Value Object
killedBy: SubmitContactCommand execute() — message validation throws ValidationError for message exceeding 300 characters
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
use-cases/commands/contact/SubmitContactCommand.ts:76:9
 
     // 4. Basic spam / suspicious content filtering
     const suspiciousPatterns = /(http|www\.|\.com|\.net|bitcoin|crypto|viagra|porn|casino|loan)/i
-    if (suspiciousPatterns.test(input.message)) {
+    if (false) {
       throw new ValidationError('Message contains suspicious content. Please remove links or promotional text.')
     }
killedBy: SubmitContactCommand execute() — spam filter throws ValidationError for http link
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
use-cases/commands/contact/SubmitContactCommand.ts:76:49
 
     // 4. Basic spam / suspicious content filtering
     const suspiciousPatterns = /(http|www\.|\.com|\.net|bitcoin|crypto|viagra|porn|casino|loan)/i
-    if (suspiciousPatterns.test(input.message)) {
-      throw new ValidationError('Message contains suspicious content. Please remove links or promotional text.')
-    }
+    if (suspiciousPatterns.test(input.message)) {}
 
     // 5. Persist to database
killedBy: SubmitContactCommand execute() — spam filter throws ValidationError for http link
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ObjectLiteral
use-cases/commands/contact/SubmitContactCommand.ts:81:26
     }
 
     // 5. Persist to database
-    await this.repo.save({
-      name:        input.name.trim(),
-      email:       email.toString(),
-      message:     input.message.trim(),
-      ipAddress:   input.ipAddress,
-      browserInfo: input.browserInfo,
-      createdAt:   new Date(),
-    })
+    await this.repo.save({})
 
     // 6. Emit domain event — OnContactSubmitted handler will send admin notification email.
killedBy: SubmitContactCommand execute() — happy path trims whitespace from name and message before saving
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Hello world", "name": "John Doe"}
Received: {}

Number of calls: 1

[Killed] MethodExpression
use-cases/commands/contact/SubmitContactCommand.ts:82:20
 
     // 5. Persist to database
     await this.repo.save({
-      name:        input.name.trim(),
+      name:        input.name,
       email:       email.toString(),
       message:     input.message.trim(),
killedBy: SubmitContactCommand execute() — happy path trims whitespace from name and message before saving
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Hello world", "name": "John Doe"}
Received: {"browserInfo": "Mozilla/5.0", "createdAt": 2026-05-28T03:36:03.379Z, "email": "john@example.com", "ipAddress": "127.0.0.1", "message": "Hello world", "name": "  John Doe  "}

Number of calls: 1

[Killed] MethodExpression
use-cases/commands/contact/SubmitContactCommand.ts:84:20
     await this.repo.save({
       name:        input.name.trim(),
       email:       email.toString(),
-      message:     input.message.trim(),
+      message:     input.message,
       ipAddress:   input.ipAddress,
       browserInfo: input.browserInfo,
killedBy: SubmitContactCommand execute() — happy path trims whitespace from name and message before saving
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Hello world", "name": "John Doe"}
Received: {"browserInfo": "Mozilla/5.0", "createdAt": 2026-05-28T03:36:03.903Z, "email": "john@example.com", "ipAddress": "127.0.0.1", "message": "  Hello world  ", "name": "John Doe"}

Number of calls: 1

[Survived] MethodExpression
use-cases/commands/contact/SubmitContactCommand.ts:95:9
     this.eventEmitter.emit(
       'contact.submitted',
       new ContactSubmittedEvent(
-        input.name.trim(),
+        input.name,
         email.toString(),
         input.message.trim(),

[Survived] MethodExpression
use-cases/commands/contact/SubmitContactCommand.ts:97:9
       new ContactSubmittedEvent(
         input.name.trim(),
         email.toString(),
-        input.message.trim(),
+        input.message,
         input.ipAddress,
         input.browserInfo,
