[Killed] BlockStatement
src/domain/value-objects/DateRange.ts:14:5
   constructor(
     public readonly start: Date,
     public readonly end:   Date | null,
-  ) {
-    if (end !== null && end < start) {
-      throw new ValidationError('End date cannot be before start date')
-    }
-  }
+  ) {}
 
   // True when the activity is still ongoing — end date not yet set
killedBy: DateRange constructor — invalid ranges throws ValidationError when end is before start
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] EqualityOperator
src/domain/value-objects/DateRange.ts:15:9
     public readonly start: Date,
     public readonly end:   Date | null,
   ) {
-    if (end !== null && end < start) {
+    if (end === null && end < start) {
       throw new ValidationError('End date cannot be before start date')
     }
killedBy: DateRange constructor — valid ranges accepts null end date (ongoing)
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "End date cannot be before start date"

      66 |         } else {
      67 |           stryCov_9fa48("155");
    > 68 |           throw new ValidationError(stryMutAct_9fa48("156") ? "" : (stryCov_9fa48("156"), 'End date cannot be before start date'));

[Killed] EqualityOperator
src/domain/value-objects/DateRange.ts:15:25
     public readonly start: Date,
     public readonly end:   Date | null,
   ) {
-    if (end !== null && end < start) {
+    if (end !== null && end >= start) {
       throw new ValidationError('End date cannot be before start date')
     }
killedBy: DateRange constructor — valid ranges accepts start date before end date
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "End date cannot be before start date"

      66 |         } else {
      67 |           stryCov_9fa48("155");
    > 68 |           throw new ValidationError(stryMutAct_9fa48("156") ? "" : (stryCov_9fa48("156"), 'End date cannot be before start date'));

[Killed] BlockStatement
src/domain/value-objects/DateRange.ts:21:28
   }
 
   // True when the activity is still ongoing — end date not yet set
-  get isOngoing(): boolean {
-    return this.end === null
-  }
+  get isOngoing(): boolean {}
 
   // Duration in milliseconds — null if ongoing
killedBy: DateRange isOngoing returns true when end is null
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/domain/value-objects/DateRange.ts:22:12
 
   // True when the activity is still ongoing — end date not yet set
   get isOngoing(): boolean {
-    return this.end === null
+    return false
   }
 
killedBy: DateRange isOngoing returns true when end is null
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/domain/value-objects/DateRange.ts:22:12
 
   // True when the activity is still ongoing — end date not yet set
   get isOngoing(): boolean {
-    return this.end === null
+    return this.end !== null
   }
 
killedBy: DateRange isOngoing returns true when end is null
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/domain/value-objects/DateRange.ts:26:35
   }
 
   // Duration in milliseconds — null if ongoing
-  get durationMs(): number | null {
-    return this.end !== null ? this.end.getTime() - this.start.getTime() : null
-  }
+  get durationMs(): number | null {}
 }
killedBy: DateRange durationMs returns null when ongoing
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] ConditionalExpression
src/domain/value-objects/DateRange.ts:27:12
 
   // Duration in milliseconds — null if ongoing
   get durationMs(): number | null {
-    return this.end !== null ? this.end.getTime() - this.start.getTime() : null
+    return false ? this.end.getTime() - this.start.getTime() : null
   }
 }
killedBy: DateRange durationMs returns correct duration in milliseconds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 31536000000
Received: null

[Killed] EqualityOperator
src/domain/value-objects/DateRange.ts:27:12
 
   // Duration in milliseconds — null if ongoing
   get durationMs(): number | null {
-    return this.end !== null ? this.end.getTime() - this.start.getTime() : null
+    return this.end === null ? this.end.getTime() - this.start.getTime() : null
   }
 }
killedBy: DateRange durationMs returns null when ongoing
statusReason: TypeError: Cannot read properties of null (reading 'getTime')
