[Killed] BlockStatement
src/domain/value-objects/Email.ts:23:30
   // Max length per RFC 5321
   private static readonly MAX_LENGTH = 254
 
-  constructor(email: string) {
-      const normalized = email.toLowerCase().trim()
-      if (!Email.isValid(normalized)) {
-          throw new ValidationError(`Invalid email: ${email}`)
-      }
-      this.value = normalized
-  }
+  constructor(email: string) {}
 
   // Stricter than bare /^[^\s@]+@[^\s@]+\.[^\s@]+$/:
killedBy: SubmitContactCommand execute() — happy path normalizes email to lowercase before saving
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"email": "john@example.com"}
Received: {"browserInfo": "Mozilla/5.0", "createdAt": 2026-05-28T03:36:07.096Z, "email": undefined, "ipAddress": "127.0.0.1", "message": "Hello, this is a test message.", "name": "John Doe"}

Number of calls: 1

[Killed] BlockStatement
src/domain/value-objects/Email.ts:25:39
 
   constructor(email: string) {
       const normalized = email.toLowerCase().trim()
-      if (!Email.isValid(normalized)) {
-          throw new ValidationError(`Invalid email: ${email}`)
-      }
+      if (!Email.isValid(normalized)) {}
       this.value = normalized
   }
killedBy: SubmitContactCommand execute() — email validation throws ValidationError for invalid email
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/domain/value-objects/Email.ts:25:11
 
   constructor(email: string) {
       const normalized = email.toLowerCase().trim()
-      if (!Email.isValid(normalized)) {
+      if (false) {
           throw new ValidationError(`Invalid email: ${email}`)
       }
killedBy: SubmitContactCommand execute() — email validation throws ValidationError for invalid email
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] StringLiteral
src/domain/value-objects/Email.ts:26:37
   constructor(email: string) {
       const normalized = email.toLowerCase().trim()
       if (!Email.isValid(normalized)) {
-          throw new ValidationError(`Invalid email: ${email}`)
+          throw new ValidationError(``)
       }
       this.value = normalized

[Killed] BlockStatement
src/domain/value-objects/Email.ts:35:42
   // - Enforces TLD is letters-only and at least 2 chars
   // - Enforces total max length
   // - Rejects multiple @ signs
-  static isValid(email: string): boolean {
-    if (!email || email.length > Email.MAX_LENGTH) return false
-
-    const parts = email.split('@')
-    if (parts.length !== 2) return false
-
-    const [local, domain] = parts
-
-    // local-part: 1–64 chars
-    if (!local || local.length > 64) return false
-
-    // domain must have at least one dot and a valid TLD
-    const domainParts = domain.split('.')
-    if (domainParts.length < 2) return false
-
-    const tld = domainParts[domainParts.length - 1]
-
-    // TLD: letters only, 2–63 chars
-    if (!/^[a-zA-Z]{2,63}$/.test(tld)) return false
-
-    // Full pattern check
-    return /^[^\s@]+@[^\s@]+\.[a-zA-Z]{2,63}$/.test(email)
-  }
+  static isValid(email: string): boolean {}
 
   toString(): string {
killedBy: SubmitContactCommand execute() — happy path saves to DB and emits event on valid input
statusReason: ValidationError: Invalid email: john@example.com

[Killed] BooleanLiteral
src/domain/value-objects/Email.ts:36:9
   // - Enforces total max length
   // - Rejects multiple @ signs
   static isValid(email: string): boolean {
-    if (!email || email.length > Email.MAX_LENGTH) return false
+    if (email || email.length > Email.MAX_LENGTH) return false
 
     const parts = email.split('@')
killedBy: SubmitContactCommand execute() — happy path saves to DB and emits event on valid input
statusReason: ValidationError: Invalid email: john@example.com

[Killed] EqualityOperator
src/domain/value-objects/Email.ts:36:19
   // - Enforces total max length
   // - Rejects multiple @ signs
   static isValid(email: string): boolean {
-    if (!email || email.length > Email.MAX_LENGTH) return false
+    if (!email || email.length <= Email.MAX_LENGTH) return false
 
     const parts = email.split('@')
killedBy: SubmitContactCommand execute() — happy path saves to DB and emits event on valid input
statusReason: ValidationError: Invalid email: john@example.com

[Killed] EqualityOperator
src/domain/value-objects/Email.ts:39:9
     if (!email || email.length > Email.MAX_LENGTH) return false
 
     const parts = email.split('@')
-    if (parts.length !== 2) return false
+    if (parts.length === 2) return false
 
     const [local, domain] = parts
killedBy: SubmitContactCommand execute() — happy path saves to DB and emits event on valid input
statusReason: ValidationError: Invalid email: john@example.com

[Killed] ConditionalExpression
src/domain/value-objects/Email.ts:39:9
     if (!email || email.length > Email.MAX_LENGTH) return false
 
     const parts = email.split('@')
-    if (parts.length !== 2) return false
+    if (true) return false
 
     const [local, domain] = parts
killedBy: SubmitContactCommand execute() — happy path saves to DB and emits event on valid input
statusReason: ValidationError: Invalid email: john@example.com

[Killed] EqualityOperator
src/domain/value-objects/Email.ts:44:19
     const [local, domain] = parts
 
     // local-part: 1–64 chars
-    if (!local || local.length > 64) return false
+    if (!local || local.length <= 64) return false
 
     // domain must have at least one dot and a valid TLD
killedBy: SubmitContactCommand execute() — happy path saves to DB and emits event on valid input
statusReason: ValidationError: Invalid email: john@example.com

[Killed] LogicalOperator
src/domain/value-objects/Email.ts:44:9
     const [local, domain] = parts
 
     // local-part: 1–64 chars
-    if (!local || local.length > 64) return false
+    if (!local && local.length > 64) return false
 
     // domain must have at least one dot and a valid TLD
killedBy: Email constructor — length limits throws ValidationError for local part exceeding 64 characters
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] BooleanLiteral
src/domain/value-objects/Email.ts:48:40
 
     // domain must have at least one dot and a valid TLD
     const domainParts = domain.split('.')
-    if (domainParts.length < 2) return false
+    if (domainParts.length < 2) return true
 
     const tld = domainParts[domainParts.length - 1]
killedBy: SubmitContactCommand execute() — email validation throws ValidationError for email missing domain
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
src/domain/value-objects/Email.ts:48:9
 
     // domain must have at least one dot and a valid TLD
     const domainParts = domain.split('.')
-    if (domainParts.length < 2) return false
+    if (domainParts.length >= 2) return false
 
     const tld = domainParts[domainParts.length - 1]
killedBy: SubmitContactCommand execute() — happy path saves to DB and emits event on valid input
statusReason: ValidationError: Invalid email: john@example.com

[Survived] ArithmeticOperator
src/domain/value-objects/Email.ts:50:29
     const domainParts = domain.split('.')
     if (domainParts.length < 2) return false
 
-    const tld = domainParts[domainParts.length - 1]
+    const tld = domainParts[domainParts.length + 1]
 
     // TLD: letters only, 2–63 chars

[Killed] ConditionalExpression
src/domain/value-objects/Email.ts:53:9
     const tld = domainParts[domainParts.length - 1]
 
     // TLD: letters only, 2–63 chars
-    if (!/^[a-zA-Z]{2,63}$/.test(tld)) return false
+    if (true) return false
 
     // Full pattern check
killedBy: SubmitContactCommand execute() — happy path saves to DB and emits event on valid input
statusReason: ValidationError: Invalid email: john@example.com

[Killed] BooleanLiteral
src/domain/value-objects/Email.ts:53:47
     const tld = domainParts[domainParts.length - 1]
 
     // TLD: letters only, 2–63 chars
-    if (!/^[a-zA-Z]{2,63}$/.test(tld)) return false
+    if (!/^[a-zA-Z]{2,63}$/.test(tld)) return true
 
     // Full pattern check
killedBy: Email constructor — invalid emails throws ValidationError for numeric TLD
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] Regex
src/domain/value-objects/Email.ts:56:12
     if (!/^[a-zA-Z]{2,63}$/.test(tld)) return false
 
     // Full pattern check
-    return /^[^\s@]+@[^\s@]+\.[a-zA-Z]{2,63}$/.test(email)
+    return /^[^\s@]+@[^\s@]\.[a-zA-Z]{2,63}$/.test(email)
   }
 
killedBy: SubmitContactCommand execute() — happy path saves to DB and emits event on valid input
statusReason: ValidationError: Invalid email: john@example.com

[Killed] Regex
src/domain/value-objects/Email.ts:56:12
     if (!/^[a-zA-Z]{2,63}$/.test(tld)) return false
 
     // Full pattern check
-    return /^[^\s@]+@[^\s@]+\.[a-zA-Z]{2,63}$/.test(email)
+    return /^[^\s@]+@[\s@]+\.[a-zA-Z]{2,63}$/.test(email)
   }
 
killedBy: SubmitContactCommand execute() — happy path saves to DB and emits event on valid input
statusReason: ValidationError: Invalid email: john@example.com

[Killed] BlockStatement
src/domain/value-objects/Email.ts:59:22
     return /^[^\s@]+@[^\s@]+\.[a-zA-Z]{2,63}$/.test(email)
   }
 
-  toString(): string {
-    return this.value
-  }
+  toString(): string {}
 }
killedBy: SubmitContactCommand execute() — happy path normalizes email to lowercase before saving
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"email": "john@example.com"}
Received: {"browserInfo": "Mozilla/5.0", "createdAt": 2026-05-28T03:36:23.798Z, "email": undefined, "ipAddress": "127.0.0.1", "message": "Hello, this is a test message.", "name": "John Doe"}

Number of calls: 1
