[Killed] BlockStatement
src/domain/value-objects/Slug.ts:21:28
 export class Slug {
   private readonly value: string
 
-  constructor(raw: string) {
-    const slugified = raw
-      .normalize('NFD')                       // decompose accented chars: "â" → "a" + combining char
-      .replace(/[\u0300-\u036f]/g, '')        // strip combining diacritical marks
-      .toLowerCase()
-      .trim()
-      .replace(/\s+/g, '-')                   // spaces → hyphens
-      .replace(/[^a-z0-9-]/g, '')            // strip non-alphanumeric except hyphens
-      .replace(/^-+|-+$/g, '')               // strip leading/trailing hyphens
-      .replace(/-{2,}/g, '-')                // collapse consecutive hyphens
-
-    if (!slugified) {
-      throw new ValidationError(`Cannot create slug from: "${raw}"`)
-    }
-
-    this.value = slugified
-  }
+  constructor(raw: string) {}
 
   // Named constructor — more expressive than new Slug(title)
killedBy: CreateBlogCommand slug generation generates slug from title and passes it to repo
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"slug": "my-first-blog-post"}
Received: {"content": "This is the content of the blog post.", "excerpt": "Short excerpt", "isPublished": false, "publishedAt": null, "slug": undefined, "tags": ["nestjs", "typescript"], "title": "My First Blog Post", "userId": 1}

Number of calls: 1

[Killed] MethodExpression
src/domain/value-objects/Slug.ts:22:23
   private readonly value: string
 
   constructor(raw: string) {
-    const slugified = raw
-      .normalize('NFD')                       // decompose accented chars: "â" → "a" + combining char
-      .replace(/[\u0300-\u036f]/g, '')        // strip combining diacritical marks
-      .toLowerCase()
+    const slugified = raw.normalize('NFD') // decompose accented chars: "â" → "a" + combining char
+.replace(/[\u0300-\u036f]/g, '') // strip combining diacritical marks
+.toUpperCase()
       .trim()
       .replace(/\s+/g, '-')                   // spaces → hyphens
killedBy: CreateBlogCommand slug generation generates slug from title and passes it to repo
statusReason: ValidationError: Cannot create slug from: "My First Blog Post"

[Survived] MethodExpression
src/domain/value-objects/Slug.ts:22:23
   private readonly value: string
 
   constructor(raw: string) {
-    const slugified = raw
-      .normalize('NFD')                       // decompose accented chars: "â" → "a" + combining char
-      .replace(/[\u0300-\u036f]/g, '')        // strip combining diacritical marks
-      .toLowerCase()
-      .trim()
+    const slugified = raw.normalize('NFD') // decompose accented chars: "â" → "a" + combining char
+.replace(/[\u0300-\u036f]/g, '') // strip combining diacritical marks
+.toLowerCase()
       .replace(/\s+/g, '-')                   // spaces → hyphens
       .replace(/[^a-z0-9-]/g, '')            // strip non-alphanumeric except hyphens

[Killed] StringLiteral
src/domain/value-objects/Slug.ts:24:36
   constructor(raw: string) {
     const slugified = raw
       .normalize('NFD')                       // decompose accented chars: "â" → "a" + combining char
-      .replace(/[\u0300-\u036f]/g, '')        // strip combining diacritical marks
+      .replace(/[\u0300-\u036f]/g, "Stryker was here!")        // strip combining diacritical marks
       .toLowerCase()
       .trim()
killedBy: CreateBlogCommand slug generation generates slug for Vietnamese titles
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"slug": "lam-tan-phu-hoc-nestjs"}

Number of calls: 1

[Killed] StringLiteral
src/domain/value-objects/Slug.ts:28:31
       .toLowerCase()
       .trim()
       .replace(/\s+/g, '-')                   // spaces → hyphens
-      .replace(/[^a-z0-9-]/g, '')            // strip non-alphanumeric except hyphens
+      .replace(/[^a-z0-9-]/g, "Stryker was here!")            // strip non-alphanumeric except hyphens
       .replace(/^-+|-+$/g, '')               // strip leading/trailing hyphens
       .replace(/-{2,}/g, '-')                // collapse consecutive hyphens
killedBy: CreateBlogCommand slug generation generates slug for titles with special characters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"slug": "hello-world-more"}
Received: {"content": "This is the content of the blog post.", "excerpt": "Short excerpt", "isPublished": false, "publishedAt": null, "slug": "helloStryker was here!-worldStryker was here!-Stryker was here!-more", "tags": ["nestjs", "typescript"], "title": "Hello, World! & More", "us

[Killed] Regex
src/domain/value-objects/Slug.ts:29:16
       .trim()
       .replace(/\s+/g, '-')                   // spaces → hyphens
       .replace(/[^a-z0-9-]/g, '')            // strip non-alphanumeric except hyphens
-      .replace(/^-+|-+$/g, '')               // strip leading/trailing hyphens
+      .replace(/-+|-+$/g, '')               // strip leading/trailing hyphens
       .replace(/-{2,}/g, '-')                // collapse consecutive hyphens
 
killedBy: CreateBlogCommand slug generation generates slug from title and passes it to repo
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"slug": "my-first-blog-post"}
Received: {"content": "This is the content of the blog post.", "excerpt": "Short excerpt", "isPublished": false, "publishedAt": null, "slug": "myfirstblogpost", "tags": ["nestjs", "typescript"], "title": "My First Blog Post", "userId": 1}

Number of calls: 1

[Survived] Regex
src/domain/value-objects/Slug.ts:29:16
       .trim()
       .replace(/\s+/g, '-')                   // spaces → hyphens
       .replace(/[^a-z0-9-]/g, '')            // strip non-alphanumeric except hyphens
-      .replace(/^-+|-+$/g, '')               // strip leading/trailing hyphens
+      .replace(/^-+|-$/g, '')               // strip leading/trailing hyphens
       .replace(/-{2,}/g, '-')                // collapse consecutive hyphens
 

[Killed] StringLiteral
src/domain/value-objects/Slug.ts:30:26
       .replace(/\s+/g, '-')                   // spaces → hyphens
       .replace(/[^a-z0-9-]/g, '')            // strip non-alphanumeric except hyphens
       .replace(/^-+|-+$/g, '')               // strip leading/trailing hyphens
-      .replace(/-{2,}/g, '-')                // collapse consecutive hyphens
+      .replace(/-{2,}/g, "")                // collapse consecutive hyphens
 
     if (!slugified) {
killedBy: CreateBlogCommand slug generation generates slug for titles with special characters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"slug": "hello-world-more"}
Received: {"content": "This is the content of the blog post.", "excerpt": "Short excerpt", "isPublished": false, "publishedAt": null, "slug": "hello-worldmore", "tags": ["nestjs", "typescript"], "title": "Hello, World! & More", "userId": 1}

Number of calls: 1

[Killed] BlockStatement
src/domain/value-objects/Slug.ts:32:21
       .replace(/^-+|-+$/g, '')               // strip leading/trailing hyphens
       .replace(/-{2,}/g, '-')                // collapse consecutive hyphens
 
-    if (!slugified) {
-      throw new ValidationError(`Cannot create slug from: "${raw}"`)
-    }
+    if (!slugified) {}
 
     this.value = slugified
killedBy: Slug from() — error cases throws ValidationError for empty string
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] ConditionalExpression
src/domain/value-objects/Slug.ts:32:9
       .replace(/^-+|-+$/g, '')               // strip leading/trailing hyphens
       .replace(/-{2,}/g, '-')                // collapse consecutive hyphens
 
-    if (!slugified) {
+    if (true) {
       throw new ValidationError(`Cannot create slug from: "${raw}"`)
     }
killedBy: CreateBlogCommand slug generation generates slug from title and passes it to repo
statusReason: ValidationError: Cannot create slug from: "My First Blog Post"

[Killed] BlockStatement
src/domain/value-objects/Slug.ts:40:36
   }
 
   // Named constructor — more expressive than new Slug(title)
-  static from(title: string): Slug {
-    return new Slug(title)
-  }
+  static from(title: string): Slug {}
 
   toString(): string {
killedBy: CreateBlogCommand slug generation generates slug from title and passes it to repo
statusReason: TypeError: Cannot read properties of undefined (reading 'toString')
