[Killed] BlockStatement
src/interface-adapters/filters/DomainExceptionFilter.ts:27:39
 export class DomainExceptionFilter implements ExceptionFilter {
   private readonly logger = new Logger(DomainExceptionFilter.name)
 
-  private get isProduction(): boolean {
-    return process.env.NODE_ENV === 'production'
-  }
+  private get isProduction(): boolean {}
 
   catch(exception: DomainError, host: ArgumentsHost): void {
killedBy: DomainExceptionFilter production mode redacts 5xx message in production
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Internal server error"}
Received: {"error": "InternalServerError", "message": "Secret DB connection string", "path": "/api/contact", "stack": "InternalServerError: Secret DB connection string

[Killed] ConditionalExpression
src/interface-adapters/filters/DomainExceptionFilter.ts:28:12
   private readonly logger = new Logger(DomainExceptionFilter.name)
 
   private get isProduction(): boolean {
-    return process.env.NODE_ENV === 'production'
+    return true
   }
 
killedBy: DomainExceptionFilter development mode includes path in development response
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "path"
Received path: []

Expected value: "/api/contact"
Received value: {"error": "ValidationError", "message": "bad", "statusCode": 400, "timestamp": "2026-05-28T03:38:00.048Z"}

[Killed] EqualityOperator
src/interface-adapters/filters/DomainExceptionFilter.ts:28:12
   private readonly logger = new Logger(DomainExceptionFilter.name)
 
   private get isProduction(): boolean {
-    return process.env.NODE_ENV === 'production'
+    return process.env.NODE_ENV !== 'production'
   }
 
killedBy: DomainExceptionFilter production mode redacts 5xx message in production
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Internal server error"}
Received: {"error": "InternalServerError", "message": "Secret DB connection string", "path": "/api/contact", "stack": "InternalServerError: Secret DB connection string

[Killed] LogicalOperator
src/interface-adapters/filters/DomainExceptionFilter.ts:39:20
     const { statusCode, message, name, code, stack } = exception
     const method = request.method
     const url    = request.url
-    const ip     = request.ip ?? 'unknown'
+    const ip     = request.ip && 'unknown'
 
     // ─── Logging ──────────────────────────────────────────────────────────────
killedBy: DomainExceptionFilter logging behavior logs warn for 401 containing the IP address
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "127.0.0.1"
Received: "[UnauthorizedError] no auth | IP: unknown | POST /api/contact"

Number of calls: 1

[Killed] LogicalOperator
src/interface-adapters/filters/DomainExceptionFilter.ts:42:9
     const ip     = request.ip ?? 'unknown'
 
     // ─── Logging ──────────────────────────────────────────────────────────────
-    if (statusCode === 401 || statusCode === 403) {
+    if (statusCode === 401 && statusCode === 403) {
       // Auth failures — log with IP for security audit trail
       this.logger.warn(`[${name}] ${message} | IP: ${ip} | ${method} ${url}`)
killedBy: DomainExceptionFilter logging behavior logs warn for 401 containing message and IP
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "no auth"

Number of calls: 0

[Killed] ConditionalExpression
src/interface-adapters/filters/DomainExceptionFilter.ts:42:9
     const ip     = request.ip ?? 'unknown'
 
     // ─── Logging ──────────────────────────────────────────────────────────────
-    if (statusCode === 401 || statusCode === 403) {
+    if (false) {
       // Auth failures — log with IP for security audit trail
       this.logger.warn(`[${name}] ${message} | IP: ${ip} | ${method} ${url}`)
killedBy: DomainExceptionFilter logging behavior logs warn for 401 containing message and IP
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "no auth"

Number of calls: 0

[Killed] StringLiteral
src/interface-adapters/filters/DomainExceptionFilter.ts:44:24
     // ─── Logging ──────────────────────────────────────────────────────────────
     if (statusCode === 401 || statusCode === 403) {
       // Auth failures — log with IP for security audit trail
-      this.logger.warn(`[${name}] ${message} | IP: ${ip} | ${method} ${url}`)
+      this.logger.warn(``)
     } else if (statusCode === 429) {
       // Rate limit — log with IP to spot abuse patterns
killedBy: DomainExceptionFilter logging behavior logs warn for 401 containing message and IP
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "no auth"
Received: ""

Number of calls: 1

[Killed] EqualityOperator
src/interface-adapters/filters/DomainExceptionFilter.ts:45:16
     if (statusCode === 401 || statusCode === 403) {
       // Auth failures — log with IP for security audit trail
       this.logger.warn(`[${name}] ${message} | IP: ${ip} | ${method} ${url}`)
-    } else if (statusCode === 429) {
+    } else if (statusCode !== 429) {
       // Rate limit — log with IP to spot abuse patterns
       this.logger.warn(`[${name}] Rate limit hit | IP: ${ip} | ${method} ${url}`)
killedBy: DomainExceptionFilter logging behavior logs warn for 429 rate limit containing Rate limit hit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Rate limit hit"

Number of calls: 0

[Killed] ConditionalExpression
src/interface-adapters/filters/DomainExceptionFilter.ts:45:16
     if (statusCode === 401 || statusCode === 403) {
       // Auth failures — log with IP for security audit trail
       this.logger.warn(`[${name}] ${message} | IP: ${ip} | ${method} ${url}`)
-    } else if (statusCode === 429) {
+    } else if (false) {
       // Rate limit — log with IP to spot abuse patterns
       this.logger.warn(`[${name}] Rate limit hit | IP: ${ip} | ${method} ${url}`)
killedBy: DomainExceptionFilter logging behavior logs warn for 429 rate limit containing Rate limit hit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Rate limit hit"

Number of calls: 0

[Killed] StringLiteral
src/interface-adapters/filters/DomainExceptionFilter.ts:47:24
       this.logger.warn(`[${name}] ${message} | IP: ${ip} | ${method} ${url}`)
     } else if (statusCode === 429) {
       // Rate limit — log with IP to spot abuse patterns
-      this.logger.warn(`[${name}] Rate limit hit | IP: ${ip} | ${method} ${url}`)
+      this.logger.warn(``)
     } else if (statusCode >= 500) {
       // Server errors — full stack in logs always, never in response
killedBy: DomainExceptionFilter logging behavior logs warn for 429 rate limit containing Rate limit hit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Rate limit hit"
Received: ""

Number of calls: 1

[Killed] BlockStatement
src/interface-adapters/filters/DomainExceptionFilter.ts:48:35
     } else if (statusCode === 429) {
       // Rate limit — log with IP to spot abuse patterns
       this.logger.warn(`[${name}] Rate limit hit | IP: ${ip} | ${method} ${url}`)
-    } else if (statusCode >= 500) {
-      // Server errors — full stack in logs always, never in response
-      this.logger.error(`[${name}] ${message} | ${method} ${url}`, stack)
-    }
+    } else if (statusCode >= 500) {}
     // 400, 404, 409, 422 — no log noise, these are normal client errors
 
killedBy: DomainExceptionFilter logging behavior logs error for 500 containing the message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "boom", Anything

Number of calls: 0

[Killed] ConditionalExpression
src/interface-adapters/filters/DomainExceptionFilter.ts:48:16
     } else if (statusCode === 429) {
       // Rate limit — log with IP to spot abuse patterns
       this.logger.warn(`[${name}] Rate limit hit | IP: ${ip} | ${method} ${url}`)
-    } else if (statusCode >= 500) {
+    } else if (false) {
       // Server errors — full stack in logs always, never in response
       this.logger.error(`[${name}] ${message} | ${method} ${url}`, stack)
killedBy: DomainExceptionFilter logging behavior logs error for 500 containing the message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "boom", Anything

Number of calls: 0

[Killed] ObjectLiteral
src/interface-adapters/filters/DomainExceptionFilter.ts:55:38
     // 400, 404, 409, 422 — no log noise, these are normal client errors
 
     // ─── Safe Response ────────────────────────────────────────────────────────
-    response.status(statusCode).json({
-      statusCode,
-      error:   code,
-
-      // 5xx in production: redact real message — never leak internals
-      message: this.isProduction && statusCode >= 500
-        ? 'Internal server error'
-        : message,
-
-      timestamp: new Date().toISOString(),
-
-      // Development extras — path and stack for easier debugging
-      // Strictly excluded in production
-      ...(!this.isProduction && {
-        path:  url,
-        stack: stack,
-      }),
-    })
+    response.status(statusCode).json({})
   }
 }
killedBy: DomainExceptionFilter production mode redacts 5xx message in production
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Internal server error"}
Received: {}

Number of calls: 1

[Killed] ConditionalExpression
src/interface-adapters/filters/DomainExceptionFilter.ts:60:16
       error:   code,
 
       // 5xx in production: redact real message — never leak internals
-      message: this.isProduction && statusCode >= 500
+      message: false
         ? 'Internal server error'
         : message,
killedBy: DomainExceptionFilter production mode redacts 5xx message in production
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Internal server error"}
Received: {"error": "InternalServerError", "message": "Secret DB connection string", "statusCode": 500, "timestamp": "2026-05-28T03:38:13.591Z"}

Number of calls: 1

[Killed] ConditionalExpression
src/interface-adapters/filters/DomainExceptionFilter.ts:60:37
       error:   code,
 
       // 5xx in production: redact real message — never leak internals
-      message: this.isProduction && statusCode >= 500
+      message: this.isProduction && true
         ? 'Internal server error'
         : message,
killedBy: DomainExceptionFilter production mode still returns real message for 4xx errors in production
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Name is too long"}
Received: {"error": "ValidationError", "message": "Internal server error", "statusCode": 400, "timestamp": "2026-05-28T03:38:14.512Z"}

Number of calls: 1

[Killed] ConditionalExpression
src/interface-adapters/filters/DomainExceptionFilter.ts:68:11
 
       // Development extras — path and stack for easier debugging
       // Strictly excluded in production
-      ...(!this.isProduction && {
-        path:  url,
-        stack: stack,
-      }),
+      ...(false),
     })
   }
killedBy: DomainExceptionFilter development mode includes path in development response
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "path"
Received path: []

Expected value: "/api/contact"
Received value: {"error": "ValidationError", "message": "bad", "statusCode": 400, "timestamp": "2026-05-28T03:38:16.761Z"}

[Killed] ConditionalExpression
src/interface-adapters/filters/DomainExceptionFilter.ts:68:11
 
       // Development extras — path and stack for easier debugging
       // Strictly excluded in production
-      ...(!this.isProduction && {
-        path:  url,
-        stack: stack,
-      }),
+      ...(true),
     })
   }
killedBy: DomainExceptionFilter development mode includes path in development response
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "path"
Received path: []

Expected value: "/api/contact"
Received value: {"error": "ValidationError", "message": "bad", "statusCode": 400, "timestamp": "2026-05-28T03:38:16.282Z"}
